kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
typedef struct
{
  __IO uint32_t TIME;     /*!< RTC time register,                                        Address offset: 0x00 */
  __IO uint32_t DATE;     /*!< RTC date register,                                        Address offset: 0x04 */
  __IO uint32_t CTRL;     /*!< RTC control register,                                     Address offset: 0x08 */
  __IO uint32_t STS;      /*!< RTC initialization and status register,                   Address offset: 0x0C */
  __IO uint32_t PSC;      /*!< RTC prescaler register,                                   Address offset: 0x10 */
  __IO uint32_t AUTORLD;  /*!< RTC wakeup timer register,                                Address offset: 0x14 */
  __IO uint32_t DCAL;     /*!< RTC calibration register,                                 Address offset: 0x18 */
  __IO uint32_t ALRMA;    /*!< RTC alarm A register,                                     Address offset: 0x1C */
  __IO uint32_t ALRMB;    /*!< RTC alarm B register,                                     Address offset: 0x20 */
  __IO uint32_t WRPROT;   /*!< RTC write protection register,                            Address offset: 0x24 */
  __IO uint32_t SUBSEC;   /*!< RTC sub second register,                                  Address offset: 0x28 */
  __IO uint32_t SHIFT;    /*!< RTC shift control register,                               Address offset: 0x2C */
  __IO uint32_t TSTIME;   /*!< RTC time stamp time register,                             Address offset: 0x30 */
  __IO uint32_t TSDATE;   /*!< RTC time stamp date register,                             Address offset: 0x34 */
  __IO uint32_t TSSUBSEC; /*!< RTC time-stamp sub second register,                       Address offset: 0x38 */
  __IO uint32_t CAL;      /*!< RTC calibration register,                                 Address offset: 0x3C */
  __IO uint32_t TACFG;    /*!< RTC tamper and alternate function configuration register, Address offset: 0x40 */
  __IO uint32_t ALRMASS;  /*!< RTC alarm A sub second register,                          Address offset: 0x44 */
  __IO uint32_t ALRMBSS;  /*!< RTC alarm B sub second register,                          Address offset: 0x48 */
  uint32_t RESERVED1;    /*!< Reserved, 0x4C                                                                 */
  __IO uint32_t BAKP0;   /*!< RTC backup register 1,                                    Address offset: 0x50 */
  __IO uint32_t BAKP1;   /*!< RTC backup register 1,                                    Address offset: 0x54 */
  __IO uint32_t BAKP2;   /*!< RTC backup register 2,                                    Address offset: 0x58 */
  __IO uint32_t BAKP3;   /*!< RTC backup register 3,                                    Address offset: 0x5C */
  __IO uint32_t BAKP4;   /*!< RTC backup register 4,                                    Address offset: 0x60 */
  __IO uint32_t BAKP5;   /*!< RTC backup register 5,                                    Address offset: 0x64 */
  __IO uint32_t BAKP6;   /*!< RTC backup register 6,                                    Address offset: 0x68 */
  __IO uint32_t BAKP7;   /*!< RTC backup register 7,                                    Address offset: 0x6C */
  __IO uint32_t BAKP8;   /*!< RTC backup register 8,                                    Address offset: 0x70 */
  __IO uint32_t BAKP9;   /*!< RTC backup register 9,                                    Address offset: 0x74 */
  __IO uint32_t BAKP10;  /*!< RTC backup register 10,                                   Address offset: 0x78 */
  __IO uint32_t BAKP11;  /*!< RTC backup register 11,                                   Address offset: 0x7C */
  __IO uint32_t BAKP12;  /*!< RTC backup register 12,                                   Address offset: 0x80 */
  __IO uint32_t BAKP13;  /*!< RTC backup register 13,                                   Address offset: 0x84 */
  __IO uint32_t BAKP14;  /*!< RTC backup register 14,                                   Address offset: 0x88 */
  __IO uint32_t BAKP15;  /*!< RTC backup register 15,                                   Address offset: 0x8C */
  __IO uint32_t BAKP16;  /*!< RTC backup register 16,                                   Address offset: 0x90 */
  __IO uint32_t BAKP17;  /*!< RTC backup register 17,                                   Address offset: 0x94 */
  __IO uint32_t BAKP18;  /*!< RTC backup register 18,                                   Address offset: 0x98 */
  __IO uint32_t BAKP19;  /*!< RTC backup register 19,                                   Address offset: 0x9C */
} RTC_TypeDef;

/**
  * @brief SD host Interface
  */

typedef struct
{
  __IO uint32_t PWRCTRL;              /*!< SDIO power control register,    Address offset: 0x00 */
  __IO uint32_t CLKCTRL;              /*!< SDI clock control register,     Address offset: 0x04 */
  __IO uint32_t ARG;                  /*!< SDIO argument register,         Address offset: 0x08 */
  __IO uint32_t CMD;                  /*!< SDIO command register,          Address offset: 0x0C */
  __IO const uint32_t  CMDRES;        /*!< SDIO command response register, Address offset: 0x10 */
  __IO const uint32_t  RES1;          /*!< SDIO response 1 register,       Address offset: 0x14 */
  __IO const uint32_t  RES2;          /*!< SDIO response 2 register,       Address offset: 0x18 */
  __IO const uint32_t  RES3;          /*!< SDIO response 3 register,       Address offset: 0x1C */
  __IO const uint32_t  RES4;          /*!< SDIO response 4 register,       Address offset: 0x20 */
  __IO uint32_t DATATIME;             /*!< SDIO data timer register,       Address offset: 0x24 */
  __IO uint32_t DATALEN;              /*!< SDIO data length register,      Address offset: 0x28 */
  __IO uint32_t DCTRL;                /*!< SDIO data control register,     Address offset: 0x2C */
  __IO const uint32_t  DCNT;          /*!< SDIO data counter register,     Address offset: 0x30 */
  __IO const uint32_t  STS;           /*!< SDIO status register,           Address offset: 0x34 */
  __IO uint32_t ICF;                  /*!< SDIO interrupt clear register,  Address offset: 0x38 */
  __IO uint32_t MASK;                 /*!< SDIO mask register,             Address offset: 0x3C */
  uint32_t      RESERVED0[2];         /*!< Reserved, 0x40-0x44                                  */
  __IO const uint32_t  FIFOCNT;       /*!< SDIO FIFO counter register,     Address offset: 0x48 */
  uint32_t      RESERVED1[13];        /*!< Reserved, 0x4C-0x7C                                  */
  __IO uint32_t FIFODATA;             /*!< SDIO data FIFO register,        Address offset: 0x80 */
} SDIO_TypeDef;

/**
  * @brief Serial Peripheral Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< SPI control register 2,                             Address offset: 0x04 */
  __IO uint32_t STS;        /*!< SPI status register,                                Address offset: 0x08 */
  __IO uint32_t DATA;       /*!< SPI data register,                                  Address offset: 0x0C */
  __IO uint32_t CRCPOLY;    /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
  __IO uint32_t RXCRC;      /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
  __IO uint32_t TXCRC;      /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
  __IO uint32_t I2SCFG;     /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
  __IO uint32_t I2SPSC;     /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */
} SPI_TypeDef;


/**
  * @brief TMR
  */

typedef struct
{
  __IO uint32_t CTRL1;        /*!< TMR control register 1,              Address offset: 0x00 */
  __IO uint32_t CTRL2;        /*!< TMR control register 2,              Address offset: 0x04 */
  __IO uint32_t SMCTRL;       /*!< TMR slave mode control register,     Address offset: 0x08 */
  __IO uint32_t DIEN;         /*!< TMR DMA/interrupt enable register,   Address offset: 0x0C */
  __IO uint32_t STS;          /*!< TMR status register,                 Address offset: 0x10 */
  __IO uint32_t CEG;          /*!< TMR event generation register,       Address offset: 0x14 */
  __IO uint32_t CCM1;         /*!< TMR capture/compare mode register 1, Address offset: 0x18 */
  __IO uint32_t CCM2;         /*!< TMR capture/compare mode register 2, Address offset: 0x1C */
  __IO uint32_t CCEN;         /*!< TMR capture/compare enable register, Address offset: 0x20 */
  __IO uint32_t CNT;          /*!< TMR counter register,                Address offset: 0x24 */
  __IO uint32_t PSC;          /*!< TMR prescaler,                       Address offset: 0x28 */
  __IO uint32_t AUTORLD;      /*!< TMR auto-reload register,            Address offset: 0x2C */
  __IO uint32_t REPCNT;       /*!< TMR repetition counter register,     Address offset: 0x30 */
  __IO uint32_t CC1;          /*!< TMR capture/compare register 1,      Address offset: 0x34 */
  __IO uint32_t CC2;          /*!< TMR capture/compare register 2,      Address offset: 0x38 */
  __IO uint32_t CC3;          /*!< TMR capture/compare register 3,      Address offset: 0x3C */
  __IO uint32_t CC4;          /*!< TMR capture/compare register 4,      Address offset: 0x40 */
  __IO uint32_t BDT;          /*!< TMR break and dead-time register,    Address offset: 0x44 */
  __IO uint32_t DCTRL;        /*!< TMR DMA control register,            Address offset: 0x48 */
  __IO uint32_t DMADDR;       /*!< TMR DMA address for full transfer,   Address offset: 0x4C */
  __IO uint32_t OPT;          /*!< TMR option register,                 Address offset: 0x50 */
} TMR_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

typedef struct
{
  __IO uint32_t STS;        /*!< USART Status register,                   Address offset: 0x00 */
  __IO uint32_t DATA;       /*!< USART Data register,                     Address offset: 0x04 */
  __IO uint32_t BR;         /*!< USART Baud rate register,                Address offset: 0x08 */
  __IO uint32_t CTRL1;      /*!< USART Control register 1,                Address offset: 0x0C */
  __IO uint32_t CTRL2;      /*!< USART Control register 2,                Address offset: 0x10 */
  __IO uint32_t CTRL3;      /*!< USART Control register 3,                Address offset: 0x14 */
  __IO uint32_t GTPSC;      /*!< USART Guard time and prescaler register, Address offset: 0x18 */
} USART_TypeDef;

/**
  * @brief Window WATCHDOG
  */

typedef struct
{
  __IO uint32_t CTRL; /*!< WWDT Control register,       Address offset: 0x00 */
  __IO uint32_t CFG;  /*!< WWDT Configuration register, Address offset: 0x04 */
  __IO uint32_t STS;  /*!< WWDT Status register,        Address offset: 0x08 */
} WWDT_TypeDef;

/**
  * @brief Crypto Processor
  */

typedef struct
{
  __IO uint32_t CTRL;       /*!< CRYP control register,                                    Address offset: 0x00 */
  __IO uint32_t STS;        /*!< CRYP status register,                                     Address offset: 0x04 */
  __IO uint32_t DATAIN;     /*!< CRYP data input register,                                 Address offset: 0x08 */
  __IO uint32_t DATAOUT;    /*!< CRYP data output register,                                Address offset: 0x0C */
  __IO uint32_t DMACTRL;    /*!< CRYP DMA control register,                                Address offset: 0x10 */
  __IO uint32_t INTMASK;    /*!< CRYP interrupt mask set/clear register,                   Address offset: 0x14 */
  __IO uint32_t INTSTS;     /*!< CRYP raw interrupt status register,                       Address offset: 0x18 */
  __IO uint32_t MINTSTS;    /*!< CRYP masked interrupt status register,                    Address offset: 0x1C */
  __IO uint32_t K0L;        /*!< CRYP key left  register 0,                                Address offset: 0x20 */
  __IO uint32_t K0R;        /*!< CRYP key right register 0,                                Address offset: 0x24 */
  __IO uint32_t K1L;        /*!< CRYP key left  register 1,                                Address offset: 0x28 */
  __IO uint32_t K1R;        /*!< CRYP key right register 1,                                Address offset: 0x2C */
  __IO uint32_t K2L;        /*!< CRYP key left  register 2,                                Address offset: 0x30 */
  __IO uint32_t K2R;        /*!< CRYP key right register 2,                                Address offset: 0x34 */
  __IO uint32_t K3L;        /*!< CRYP key left  register 3,                                Address offset: 0x38 */
  __IO uint32_t K3R;        /*!< CRYP key right register 3,                                Address offset: 0x3C */
  __IO uint32_t IV0L;       /*!< CRYP initialization vector left-word  register 0,         Address offset: 0x40 */
  __IO uint32_t IV0R;       /*!< CRYP initialization vector right-word register 0,         Address offset: 0x44 */
  __IO uint32_t IV1L;       /*!< CRYP initialization vector left-word  register 1,         Address offset: 0x48 */
  __IO uint32_t IV1R;       /*!< CRYP initialization vector right-word register 1,         Address offset: 0x4C */
  __IO uint32_t CSGCMCCM0R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 0,        Address offset: 0x50 */
  __IO uint32_t CSGCMCCM1R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 1,        Address offset: 0x54 */
  __IO uint32_t CSGCMCCM2R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 2,        Address offset: 0x58 */
  __IO uint32_t CSGCMCCM3R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 3,        Address offset: 0x5C */
  __IO uint32_t CSGCMCCM4R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 4,        Address offset: 0x60 */
  __IO uint32_t CSGCMCCM5R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 5,        Address offset: 0x64 */
  __IO uint32_t CSGCMCCM6R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 6,        Address offset: 0x68 */
  __IO uint32_t CSGCMCCM7R; /*!< CRYP GCM/GMAC or CCM/CMAC context swap register 7,        Address offset: 0x6C */
  __IO uint32_t CSGCM0R;    /*!< CRYP GCM/GMAC context swap register 0,                    Address offset: 0x70 */
  __IO uint32_t CSGCM1R;    /*!< CRYP GCM/GMAC context swap register 1,                    Address offset: 0x74 */
  __IO uint32_t CSGCM2R;    /*!< CRYP GCM/GMAC context swap register 2,                    Address offset: 0x78 */
  __IO uint32_t CSGCM3R;    /*!< CRYP GCM/GMAC context swap register 3,                    Address offset: 0x7C */
  __IO uint32_t CSGCM4R;    /*!< CRYP GCM/GMAC context swap register 4,                    Address offset: 0x80 */
  __IO uint32_t CSGCM5R;    /*!< CRYP GCM/GMAC context swap register 5,                    Address offset: 0x84 */
  __IO uint32_t CSGCM6R;    /*!< CRYP GCM/GMAC context swap register 6,                    Address offset: 0x88 */
  __IO uint32_t CSGCM7R;    /*!< CRYP GCM/GMAC context swap register 7,                    Address offset: 0x8C */
} CRYP_TypeDef;

/**
  * @brief HASH
  */

typedef struct
{
  __IO uint32_t CTRL;             /*!< HASH control register,          Address offset: 0x00        */
  __IO uint32_t INDATA;           /*!< HASH data input register,       Address offset: 0x04        */
  __IO uint32_t START;            /*!< HASH start register,            Address offset: 0x08        */
  __IO uint32_t DIG[5];           /*!< HASH digest registers,          Address offset: 0x0C-0x1C   */
  __IO uint32_t INT;              /*!< HASH interrupt enable register, Address offset: 0x20        */
  __IO uint32_t STS;              /*!< HASH status register,           Address offset: 0x24        */
       uint32_t RESERVED[52];     /*!< Reserved, 0x28-0xF4                                         */
  __IO uint32_t CTSWAP[54];       /*!< HASH context swap registers,    Address offset: 0x0F8-0x1CC */
} HASH_TypeDef;

/**
  * @brief HASH_DIGEST
  */

typedef struct
{
  __IO uint32_t HR[5];     /*!< HASH digest registers,          Address offset: 0x310-0x32C */
} HASH_DIGEST_TypeDef;

/**
  * @brief RNG
  */

typedef struct
{
  __IO uint32_t CTRL; /*!< RNG control register, Address offset: 0x00 */
  __IO uint32_t STS;  /*!< RNG status register,  Address offset: 0x04 */
  __IO uint32_t DATA; /*!< RNG data register,    Address offset: 0x08 */
} RNG_TypeDef;

/**
  * @brief USB_OTG_Core_Registers
  */
typedef struct
{
  __IO uint32_t GCTRLSTS;             /*!< USB_OTG Control and Status Register          000h */
  __IO uint32_t GINT;                 /*!< USB_OTG Interrupt Register                   004h */
  __IO uint32_t GAHBCFG;              /*!< Core AHB Configuration Register              008h */
  __IO uint32_t GUSBCFG;              /*!< Core USB Configuration Register              00Ch */
  __IO uint32_t GRSTCTRL;             /*!< Core Reset Register                          010h */
  __IO uint32_t GCINT;                /*!< Core Interrupt Register                      014h */
  __IO uint32_t GINTMASK;             /*!< Core Interrupt Mask Register                 018h */
  __IO uint32_t GRXSTS;               /*!< Receive Sts Q Read Register                  01Ch */
  __IO uint32_t GRXSTSP;              /*!< Receive Sts Q Read & POP Register            020h */
  __IO uint32_t GRXFIFO;              /*!< Receive FIFO Size Register                   024h */
  __IO uint32_t GTXFCFG;              /*!< EP0 / Non Periodic Tx FIFO Size Register     028h */
  __IO uint32_t GNPTXFQSTS;           /*!< Non Periodic Tx FIFO/Queue Sts reg           02Ch */
  uint32_t Reserved30[2];             /*!< Reserved                                     030h */
  __IO uint32_t GGCCFG;               /*!< General Purpose IO Register                  038h */
  __IO uint32_t GCID;                 /*!< User ID Register                             03Ch */
  uint32_t  Reserved40[48];           /*!< Reserved                                0x40-0xFF */
  __IO uint32_t GHPTXFSIZE;           /*!< Host Periodic Tx FIFO Size Reg               100h */
  __IO uint32_t DTXFIFO[0x0F];        /*!< dev Periodic Transmit FIFO                        */
} USB_OTG_GlobalTypeDef;

/**
  * @brief USB_OTG_device_Registers
  */
typedef struct
{
  __IO uint32_t DCFG;           /*!< dev Configuration Register   800h */
  __IO uint32_t DCTRL;          /*!< dev Control Register         804h */
  __IO uint32_t DSTS;           /*!< dev Status Register (RO)     808h */
  uint32_t Reserved0C;          /*!< Reserved                     80Ch */
  __IO uint32_t DINIMASK;       /*!< dev IN Endpoint Mask         810h */
  __IO uint32_t DOUTIMASK;      /*!< dev OUT Endpoint Mask        814h */
  __IO uint32_t DAEPINT;        /*!< dev All Endpoints Itr Reg    818h */
  __IO uint32_t DAEPIMASK;      /*!< dev All Endpoints Itr Mask   81Ch */
  uint32_t  Reserved20;         /*!< Reserved                     820h */
  uint32_t Reserved9;           /*!< Reserved                     824h */
  __IO uint32_t DVBUSDTIM;      /*!< dev VBUS discharge Register  828h */
  __IO uint32_t DVBUSPTIM;      /*!< dev VBUS Pulse Register      82Ch */
  __IO uint32_t DTHCTRL;        /*!< dev threshold                830h */
  __IO uint32_t DIEIMASK;       /*!< dev empty msk                834h */
  __IO uint32_t DEPINT;         /*!< dedicated EP interrupt       838h */
  __IO uint32_t DEPIMASK;       /*!< dedicated EP msk             83Ch */
  uint32_t Reserved40;          /*!< dedicated EP mask            840h */
  __IO uint32_t DIN1IMASK;      /*!< dedicated EP mask            844h */
  uint32_t  Reserved44[15];     /*!< Reserved                 844-87Ch */
  __IO uint32_t DOUT1MASK;      /*!< dedicated EP msk             884h */
} USB_OTG_DeviceTypeDef;

/**
  * @brief USB_OTG_IN_Endpoint-Specific_Register
  */
typedef struct
{
  __IO uint32_t DIEPCTRL;         /*!< dev IN Endpoint Control Reg    900h + (ep_num * 20h) + 00h */
  uint32_t Reserved04;            /*!< Reserved                       900h + (ep_num * 20h) + 04h */
  __IO uint32_t DIEPINT;          /*!< dev IN Endpoint Itr Reg        900h + (ep_num * 20h) + 08h */
  uint32_t Reserved0C;            /*!< Reserved                       900h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DIEPTRS;          /*!< IN Endpoint Txfer Size         900h + (ep_num * 20h) + 10h */
  __IO uint32_t DIEPDMA;          /*!< IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h */
  __IO uint32_t DITXFSTS;         /*!< IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h */
  uint32_t Reserved18;            /*!< Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch */
} USB_OTG_INEndpointTypeDef;

/**
  * @brief USB_OTG_OUT_Endpoint-Specific_Registers
  */
typedef struct
{
  __IO uint32_t DOEPCTRL;       /*!< dev OUT Endpoint Control Reg           B00h + (ep_num * 20h) + 00h */
  uint32_t Reserved04;          /*!< Reserved                               B00h + (ep_num * 20h) + 04h */
  __IO uint32_t DOEPINT;        /*!< dev OUT Endpoint Itr Reg               B00h + (ep_num * 20h) + 08h */
  uint32_t Reserved0C;          /*!< Reserved                               B00h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DOEPTRS;        /*!< dev OUT Endpoint Txfer Size            B00h + (ep_num * 20h) + 10h */
  __IO uint32_t DOEPDMA;        /*!< dev OUT Endpoint DMA Address           B00h + (ep_num * 20h) + 14h */
  uint32_t Reserved18[2];       /*!< Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} USB_OTG_OUTEndpointTypeDef;

/**
  * @brief USB_OTG_Host_Mode_Register_Structures
  */
typedef struct
{
  __IO uint32_t HCFG;             /*!< Host Configuration Register          400h */
  __IO uint32_t HFIVL;            /*!< Host Frame Interval Register         404h */
  __IO uint32_t HFIFM;            /*!< Host Frame Nbr/Frame Remaining       408h */
  uint32_t Reserved40C;           /*!< Reserved                             40Ch */
  __IO uint32_t HPTXSTS;          /*!< Host Periodic Tx FIFO/ Queue Status  410h */
  __IO uint32_t HACHINT;          /*!< Host All Channels Interrupt Register 414h */
  __IO uint32_t HACHIMASK;        /*!< Host All Channels Interrupt Mask     418h */
} USB_OTG_HostTypeDef;

/**
  * @brief USB_OTG_Host_Channel_Specific_Registers
  */
typedef struct
{
  __IO uint32_t HCH;              /*!< Host Channel Characteristics Register    500h */
  __IO uint32_t HCHSCTRL;         /*!< Host Channel Split Control Register      504h */
  __IO uint32_t HCHINT;           /*!< Host Channel Interrupt Register          508h */
  __IO uint32_t HCHIMASK;         /*!< Host Channel Interrupt Mask Register     50Ch */
  __IO uint32_t HCHTSIZE;         /*!< Host Channel Transfer Size Register      510h */
  __IO uint32_t HCHDMA;           /*!< Host Channel DMA Address Register        514h */
  uint32_t Reserved[2];           /*!< Reserved                                      */
} USB_OTG_HostChannelTypeDef;

