kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/*******************  Bit definition for ADC_REGSEQ2 register  *******************/
#define ADC_REGSEQ2_REGSEQC7_Pos                                    (0U)
#define ADC_REGSEQ2_REGSEQC7_Msk                                    (0x1FUL << ADC_REGSEQ2_REGSEQC7_Pos)                           /*!< 0x0000001F */
#define ADC_REGSEQ2_REGSEQC7                                        ADC_REGSEQ2_REGSEQC7_Msk                                       /*!<SQ7[4:0] bits (7th conversion in regular sequence) */
#define ADC_REGSEQ2_REGSEQC7_0                                      (0x01UL << ADC_REGSEQ2_REGSEQC7_Pos)                           /*!< 0x00000001 */
#define ADC_REGSEQ2_REGSEQC7_1                                      (0x02UL << ADC_REGSEQ2_REGSEQC7_Pos)                           /*!< 0x00000002 */
#define ADC_REGSEQ2_REGSEQC7_2                                      (0x04UL << ADC_REGSEQ2_REGSEQC7_Pos)                           /*!< 0x00000004 */
#define ADC_REGSEQ2_REGSEQC7_3                                      (0x08UL << ADC_REGSEQ2_REGSEQC7_Pos)                           /*!< 0x00000008 */
#define ADC_REGSEQ2_REGSEQC7_4                                      (0x10UL << ADC_REGSEQ2_REGSEQC7_Pos)                           /*!< 0x00000010 */
#define ADC_REGSEQ2_REGSEQC8_Pos                                    (5U)
#define ADC_REGSEQ2_REGSEQC8_Msk                                    (0x1FUL << ADC_REGSEQ2_REGSEQC8_Pos)                           /*!< 0x000003E0 */
#define ADC_REGSEQ2_REGSEQC8                                        ADC_REGSEQ2_REGSEQC8_Msk                                       /*!<SQ8[4:0] bits (8th conversion in regular sequence) */
#define ADC_REGSEQ2_REGSEQC8_0                                      (0x01UL << ADC_REGSEQ2_REGSEQC8_Pos)                           /*!< 0x00000020 */
#define ADC_REGSEQ2_REGSEQC8_1                                      (0x02UL << ADC_REGSEQ2_REGSEQC8_Pos)                           /*!< 0x00000040 */
#define ADC_REGSEQ2_REGSEQC8_2                                      (0x04UL << ADC_REGSEQ2_REGSEQC8_Pos)                           /*!< 0x00000080 */
#define ADC_REGSEQ2_REGSEQC8_3                                      (0x08UL << ADC_REGSEQ2_REGSEQC8_Pos)                           /*!< 0x00000100 */
#define ADC_REGSEQ2_REGSEQC8_4                                      (0x10UL << ADC_REGSEQ2_REGSEQC8_Pos)                           /*!< 0x00000200 */
#define ADC_REGSEQ2_REGSEQC9_Pos                                    (10U)
#define ADC_REGSEQ2_REGSEQC9_Msk                                    (0x1FUL << ADC_REGSEQ2_REGSEQC9_Pos)                           /*!< 0x00007C00 */
#define ADC_REGSEQ2_REGSEQC9                                        ADC_REGSEQ2_REGSEQC9_Msk                                       /*!<SQ9[4:0] bits (9th conversion in regular sequence) */
#define ADC_REGSEQ2_REGSEQC9_0                                      (0x01UL << ADC_REGSEQ2_REGSEQC9_Pos)                           /*!< 0x00000400 */
#define ADC_REGSEQ2_REGSEQC9_1                                      (0x02UL << ADC_REGSEQ2_REGSEQC9_Pos)                           /*!< 0x00000800 */
#define ADC_REGSEQ2_REGSEQC9_2                                      (0x04UL << ADC_REGSEQ2_REGSEQC9_Pos)                           /*!< 0x00001000 */
#define ADC_REGSEQ2_REGSEQC9_3                                      (0x08UL << ADC_REGSEQ2_REGSEQC9_Pos)                           /*!< 0x00002000 */
#define ADC_REGSEQ2_REGSEQC9_4                                      (0x10UL << ADC_REGSEQ2_REGSEQC9_Pos)                           /*!< 0x00004000 */
#define ADC_REGSEQ2_REGSEQC10_Pos                                   (15U)
#define ADC_REGSEQ2_REGSEQC10_Msk                                   (0x1FUL << ADC_REGSEQ2_REGSEQC10_Pos)                          /*!< 0x000F8000 */
#define ADC_REGSEQ2_REGSEQC10                                       ADC_REGSEQ2_REGSEQC10_Msk                                      /*!<SQ10[4:0] bits (10th conversion in regular sequence) */
#define ADC_REGSEQ2_REGSEQC10_0                                     (0x01UL << ADC_REGSEQ2_REGSEQC10_Pos)                          /*!< 0x00008000 */
#define ADC_REGSEQ2_REGSEQC10_1                                     (0x02UL << ADC_REGSEQ2_REGSEQC10_Pos)                          /*!< 0x00010000 */
#define ADC_REGSEQ2_REGSEQC10_2                                     (0x04UL << ADC_REGSEQ2_REGSEQC10_Pos)                          /*!< 0x00020000 */
#define ADC_REGSEQ2_REGSEQC10_3                                     (0x08UL << ADC_REGSEQ2_REGSEQC10_Pos)                          /*!< 0x00040000 */
#define ADC_REGSEQ2_REGSEQC10_4                                     (0x10UL << ADC_REGSEQ2_REGSEQC10_Pos)                          /*!< 0x00080000 */
#define ADC_REGSEQ2_REGSEQC11_Pos                                   (20U)
#define ADC_REGSEQ2_REGSEQC11_Msk                                   (0x1FUL << ADC_REGSEQ2_REGSEQC11_Pos)                          /*!< 0x01F00000 */
#define ADC_REGSEQ2_REGSEQC11                                       ADC_REGSEQ2_REGSEQC11_Msk                                      /*!<SQ11[4:0] bits (11th conversion in regular sequence) */
#define ADC_REGSEQ2_REGSEQC11_0                                     (0x01UL << ADC_REGSEQ2_REGSEQC11_Pos)                          /*!< 0x00100000 */
#define ADC_REGSEQ2_REGSEQC11_1                                     (0x02UL << ADC_REGSEQ2_REGSEQC11_Pos)                          /*!< 0x00200000 */
#define ADC_REGSEQ2_REGSEQC11_2                                     (0x04UL << ADC_REGSEQ2_REGSEQC11_Pos)                          /*!< 0x00400000 */
#define ADC_REGSEQ2_REGSEQC11_3                                     (0x08UL << ADC_REGSEQ2_REGSEQC11_Pos)                          /*!< 0x00800000 */
#define ADC_REGSEQ2_REGSEQC11_4                                     (0x10UL << ADC_REGSEQ2_REGSEQC11_Pos)                          /*!< 0x01000000 */
#define ADC_REGSEQ2_REGSEQC12_Pos                                   (25U)
#define ADC_REGSEQ2_REGSEQC12_Msk                                   (0x1FUL << ADC_REGSEQ2_REGSEQC12_Pos)                          /*!< 0x3E000000 */
#define ADC_REGSEQ2_REGSEQC12                                       ADC_REGSEQ2_REGSEQC12_Msk                                      /*!<SQ12[4:0] bits (12th conversion in regular sequence) */
#define ADC_REGSEQ2_REGSEQC12_0                                     (0x01UL << ADC_REGSEQ2_REGSEQC12_Pos)                          /*!< 0x02000000 */
#define ADC_REGSEQ2_REGSEQC12_1                                     (0x02UL << ADC_REGSEQ2_REGSEQC12_Pos)                          /*!< 0x04000000 */
#define ADC_REGSEQ2_REGSEQC12_2                                     (0x04UL << ADC_REGSEQ2_REGSEQC12_Pos)                          /*!< 0x08000000 */
#define ADC_REGSEQ2_REGSEQC12_3                                     (0x08UL << ADC_REGSEQ2_REGSEQC12_Pos)                          /*!< 0x10000000 */
#define ADC_REGSEQ2_REGSEQC12_4                                     (0x10UL << ADC_REGSEQ2_REGSEQC12_Pos)                          /*!< 0x20000000 */

/*******************  Bit definition for ADC_REGSEQ3 register  *******************/
#define ADC_REGSEQ3_REGSEQC1_Pos                                    (0U)
#define ADC_REGSEQ3_REGSEQC1_Msk                                    (0x1FUL << ADC_REGSEQ3_REGSEQC1_Pos)                           /*!< 0x0000001F */
#define ADC_REGSEQ3_REGSEQC1                                        ADC_REGSEQ3_REGSEQC1_Msk                                       /*!<SQ1[4:0] bits (1st conversion in regular sequence) */
#define ADC_REGSEQ3_REGSEQC1_0                                      (0x01UL << ADC_REGSEQ3_REGSEQC1_Pos)                           /*!< 0x00000001 */
#define ADC_REGSEQ3_REGSEQC1_1                                      (0x02UL << ADC_REGSEQ3_REGSEQC1_Pos)                           /*!< 0x00000002 */
#define ADC_REGSEQ3_REGSEQC1_2                                      (0x04UL << ADC_REGSEQ3_REGSEQC1_Pos)                           /*!< 0x00000004 */
#define ADC_REGSEQ3_REGSEQC1_3                                      (0x08UL << ADC_REGSEQ3_REGSEQC1_Pos)                           /*!< 0x00000008 */
#define ADC_REGSEQ3_REGSEQC1_4                                      (0x10UL << ADC_REGSEQ3_REGSEQC1_Pos)                           /*!< 0x00000010 */
#define ADC_REGSEQ3_REGSEQC2_Pos                                    (5U)
#define ADC_REGSEQ3_REGSEQC2_Msk                                    (0x1FUL << ADC_REGSEQ3_REGSEQC2_Pos)                           /*!< 0x000003E0 */
#define ADC_REGSEQ3_REGSEQC2                                        ADC_REGSEQ3_REGSEQC2_Msk                                       /*!<SQ2[4:0] bits (2nd conversion in regular sequence) */
#define ADC_REGSEQ3_REGSEQC2_0                                      (0x01UL << ADC_REGSEQ3_REGSEQC2_Pos)                           /*!< 0x00000020 */
#define ADC_REGSEQ3_REGSEQC2_1                                      (0x02UL << ADC_REGSEQ3_REGSEQC2_Pos)                           /*!< 0x00000040 */
#define ADC_REGSEQ3_REGSEQC2_2                                      (0x04UL << ADC_REGSEQ3_REGSEQC2_Pos)                           /*!< 0x00000080 */
#define ADC_REGSEQ3_REGSEQC2_3                                      (0x08UL << ADC_REGSEQ3_REGSEQC2_Pos)                           /*!< 0x00000100 */
#define ADC_REGSEQ3_REGSEQC2_4                                      (0x10UL << ADC_REGSEQ3_REGSEQC2_Pos)                           /*!< 0x00000200 */
#define ADC_REGSEQ3_REGSEQC3_Pos                                    (10U)
#define ADC_REGSEQ3_REGSEQC3_Msk                                    (0x1FUL << ADC_REGSEQ3_REGSEQC3_Pos)                           /*!< 0x00007C00 */
#define ADC_REGSEQ3_REGSEQC3                                        ADC_REGSEQ3_REGSEQC3_Msk                                       /*!<SQ3[4:0] bits (3rd conversion in regular sequence) */
#define ADC_REGSEQ3_REGSEQC3_0                                      (0x01UL << ADC_REGSEQ3_REGSEQC3_Pos)                           /*!< 0x00000400 */
#define ADC_REGSEQ3_REGSEQC3_1                                      (0x02UL << ADC_REGSEQ3_REGSEQC3_Pos)                           /*!< 0x00000800 */
#define ADC_REGSEQ3_REGSEQC3_2                                      (0x04UL << ADC_REGSEQ3_REGSEQC3_Pos)                           /*!< 0x00001000 */
#define ADC_REGSEQ3_REGSEQC3_3                                      (0x08UL << ADC_REGSEQ3_REGSEQC3_Pos)                           /*!< 0x00002000 */
#define ADC_REGSEQ3_REGSEQC3_4                                      (0x10UL << ADC_REGSEQ3_REGSEQC3_Pos)                           /*!< 0x00004000 */
#define ADC_REGSEQ3_REGSEQC4_Pos                                    (15U)
#define ADC_REGSEQ3_REGSEQC4_Msk                                    (0x1FUL << ADC_REGSEQ3_REGSEQC4_Pos)                           /*!< 0x000F8000 */
#define ADC_REGSEQ3_REGSEQC4                                        ADC_REGSEQ3_REGSEQC4_Msk                                       /*!<SQ4[4:0] bits (4th conversion in regular sequence) */
#define ADC_REGSEQ3_REGSEQC4_0                                      (0x01UL << ADC_REGSEQ3_REGSEQC4_Pos)                           /*!< 0x00008000 */
#define ADC_REGSEQ3_REGSEQC4_1                                      (0x02UL << ADC_REGSEQ3_REGSEQC4_Pos)                           /*!< 0x00010000 */
#define ADC_REGSEQ3_REGSEQC4_2                                      (0x04UL << ADC_REGSEQ3_REGSEQC4_Pos)                           /*!< 0x00020000 */
#define ADC_REGSEQ3_REGSEQC4_3                                      (0x08UL << ADC_REGSEQ3_REGSEQC4_Pos)                           /*!< 0x00040000 */
#define ADC_REGSEQ3_REGSEQC4_4                                      (0x10UL << ADC_REGSEQ3_REGSEQC4_Pos)                           /*!< 0x00080000 */
#define ADC_REGSEQ3_REGSEQC5_Pos                                    (20U)
#define ADC_REGSEQ3_REGSEQC5_Msk                                    (0x1FUL << ADC_REGSEQ3_REGSEQC5_Pos)                           /*!< 0x01F00000 */
#define ADC_REGSEQ3_REGSEQC5                                        ADC_REGSEQ3_REGSEQC5_Msk                                       /*!<SQ5[4:0] bits (5th conversion in regular sequence) */
#define ADC_REGSEQ3_REGSEQC5_0                                      (0x01UL << ADC_REGSEQ3_REGSEQC5_Pos)                           /*!< 0x00100000 */
#define ADC_REGSEQ3_REGSEQC5_1                                      (0x02UL << ADC_REGSEQ3_REGSEQC5_Pos)                           /*!< 0x00200000 */
#define ADC_REGSEQ3_REGSEQC5_2                                      (0x04UL << ADC_REGSEQ3_REGSEQC5_Pos)                           /*!< 0x00400000 */
#define ADC_REGSEQ3_REGSEQC5_3                                      (0x08UL << ADC_REGSEQ3_REGSEQC5_Pos)                           /*!< 0x00800000 */
#define ADC_REGSEQ3_REGSEQC5_4                                      (0x10UL << ADC_REGSEQ3_REGSEQC5_Pos)                           /*!< 0x01000000 */
#define ADC_REGSEQ3_REGSEQC6_Pos                                    (25U)
#define ADC_REGSEQ3_REGSEQC6_Msk                                    (0x1FUL << ADC_REGSEQ3_REGSEQC6_Pos)                           /*!< 0x3E000000 */
#define ADC_REGSEQ3_REGSEQC6                                        ADC_REGSEQ3_REGSEQC6_Msk                                       /*!<SQ6[4:0] bits (6th conversion in regular sequence) */
#define ADC_REGSEQ3_REGSEQC6_0                                      (0x01UL << ADC_REGSEQ3_REGSEQC6_Pos)                           /*!< 0x02000000 */
#define ADC_REGSEQ3_REGSEQC6_1                                      (0x02UL << ADC_REGSEQ3_REGSEQC6_Pos)                           /*!< 0x04000000 */
#define ADC_REGSEQ3_REGSEQC6_2                                      (0x04UL << ADC_REGSEQ3_REGSEQC6_Pos)                           /*!< 0x08000000 */
#define ADC_REGSEQ3_REGSEQC6_3                                      (0x08UL << ADC_REGSEQ3_REGSEQC6_Pos)                           /*!< 0x10000000 */
#define ADC_REGSEQ3_REGSEQC6_4                                      (0x10UL << ADC_REGSEQ3_REGSEQC6_Pos)                           /*!< 0x20000000 */

/*******************  Bit definition for ADC_INJSEQ register  *******************/
#define ADC_INJSEQ_INJSEQC1_Pos                                     (0U)
#define ADC_INJSEQ_INJSEQC1_Msk                                     (0x1FUL << ADC_INJSEQ_INJSEQC1_Pos)                            /*!< 0x0000001F */
#define ADC_INJSEQ_INJSEQC1                                         ADC_INJSEQ_INJSEQC1_Msk                                        /*!<JSQ1[4:0] bits (1st conversion in injected sequence) */
#define ADC_INJSEQ_INJSEQC1_0                                       (0x01UL << ADC_INJSEQ_INJSEQC1_Pos)                            /*!< 0x00000001 */
#define ADC_INJSEQ_INJSEQC1_1                                       (0x02UL << ADC_INJSEQ_INJSEQC1_Pos)                            /*!< 0x00000002 */
#define ADC_INJSEQ_INJSEQC1_2                                       (0x04UL << ADC_INJSEQ_INJSEQC1_Pos)                            /*!< 0x00000004 */
#define ADC_INJSEQ_INJSEQC1_3                                       (0x08UL << ADC_INJSEQ_INJSEQC1_Pos)                            /*!< 0x00000008 */
#define ADC_INJSEQ_INJSEQC1_4                                       (0x10UL << ADC_INJSEQ_INJSEQC1_Pos)                            /*!< 0x00000010 */
#define ADC_INJSEQ_INJSEQC2_Pos                                     (5U)
#define ADC_INJSEQ_INJSEQC2_Msk                                     (0x1FUL << ADC_INJSEQ_INJSEQC2_Pos)                            /*!< 0x000003E0 */
#define ADC_INJSEQ_INJSEQC2                                         ADC_INJSEQ_INJSEQC2_Msk                                        /*!<JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define ADC_INJSEQ_INJSEQC2_0                                       (0x01UL << ADC_INJSEQ_INJSEQC2_Pos)                            /*!< 0x00000020 */
#define ADC_INJSEQ_INJSEQC2_1                                       (0x02UL << ADC_INJSEQ_INJSEQC2_Pos)                            /*!< 0x00000040 */
#define ADC_INJSEQ_INJSEQC2_2                                       (0x04UL << ADC_INJSEQ_INJSEQC2_Pos)                            /*!< 0x00000080 */
#define ADC_INJSEQ_INJSEQC2_3                                       (0x08UL << ADC_INJSEQ_INJSEQC2_Pos)                            /*!< 0x00000100 */
#define ADC_INJSEQ_INJSEQC2_4                                       (0x10UL << ADC_INJSEQ_INJSEQC2_Pos)                            /*!< 0x00000200 */
#define ADC_INJSEQ_INJSEQC3_Pos                                     (10U)
#define ADC_INJSEQ_INJSEQC3_Msk                                     (0x1FUL << ADC_INJSEQ_INJSEQC3_Pos)                            /*!< 0x00007C00 */
#define ADC_INJSEQ_INJSEQC3                                         ADC_INJSEQ_INJSEQC3_Msk                                        /*!<JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define ADC_INJSEQ_INJSEQC3_0                                       (0x01UL << ADC_INJSEQ_INJSEQC3_Pos)                            /*!< 0x00000400 */
#define ADC_INJSEQ_INJSEQC3_1                                       (0x02UL << ADC_INJSEQ_INJSEQC3_Pos)                            /*!< 0x00000800 */
#define ADC_INJSEQ_INJSEQC3_2                                       (0x04UL << ADC_INJSEQ_INJSEQC3_Pos)                            /*!< 0x00001000 */
#define ADC_INJSEQ_INJSEQC3_3                                       (0x08UL << ADC_INJSEQ_INJSEQC3_Pos)                            /*!< 0x00002000 */
#define ADC_INJSEQ_INJSEQC3_4                                       (0x10UL << ADC_INJSEQ_INJSEQC3_Pos)                            /*!< 0x00004000 */
#define ADC_INJSEQ_INJSEQC4_Pos                                     (15U)
#define ADC_INJSEQ_INJSEQC4_Msk                                     (0x1FUL << ADC_INJSEQ_INJSEQC4_Pos)                            /*!< 0x000F8000 */
#define ADC_INJSEQ_INJSEQC4                                         ADC_INJSEQ_INJSEQC4_Msk                                        /*!<JSQ4[4:0] bits (4th conversion in injected sequence) */
#define ADC_INJSEQ_INJSEQC4_0                                       (0x01UL << ADC_INJSEQ_INJSEQC4_Pos)                            /*!< 0x00008000 */
#define ADC_INJSEQ_INJSEQC4_1                                       (0x02UL << ADC_INJSEQ_INJSEQC4_Pos)                            /*!< 0x00010000 */
#define ADC_INJSEQ_INJSEQC4_2                                       (0x04UL << ADC_INJSEQ_INJSEQC4_Pos)                            /*!< 0x00020000 */
#define ADC_INJSEQ_INJSEQC4_3                                       (0x08UL << ADC_INJSEQ_INJSEQC4_Pos)                            /*!< 0x00040000 */
#define ADC_INJSEQ_INJSEQC4_4                                       (0x10UL << ADC_INJSEQ_INJSEQC4_Pos)                            /*!< 0x00080000 */
#define ADC_INJSEQ_INJSEQLEN_Pos                                    (20U)
#define ADC_INJSEQ_INJSEQLEN_Msk                                    (0x3UL << ADC_INJSEQ_INJSEQLEN_Pos)                            /*!< 0x00300000 */
#define ADC_INJSEQ_INJSEQLEN                                        ADC_INJSEQ_INJSEQLEN_Msk                                       /*!<JL[1:0] bits (Injected Sequence length) */
#define ADC_INJSEQ_INJSEQLEN_0                                      (0x1UL << ADC_INJSEQ_INJSEQLEN_Pos)                            /*!< 0x00100000 */
#define ADC_INJSEQ_INJSEQLEN_1                                      (0x2UL << ADC_INJSEQ_INJSEQLEN_Pos)                            /*!< 0x00200000 */

