kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/*!<CAN filter registers */
/*******************  Bit definition for CAN_FCTRL register  ********************/
#define CAN_FCTRL_FINITEN_Pos                                       (0U)
#define CAN_FCTRL_FINITEN_Msk                                       (0x1UL << CAN_FCTRL_FINITEN_Pos)                               /*!< 0x00000001 */
#define CAN_FCTRL_FINITEN                                           CAN_FCTRL_FINITEN_Msk                                          /*!<Filter Init Mode */
#define CAN_FCTRL_CAN2SB_Pos                                        (8U)
#define CAN_FCTRL_CAN2SB_Msk                                        (0x3FUL << CAN_FCTRL_CAN2SB_Pos)                               /*!< 0x00003F00 */
#define CAN_FCTRL_CAN2SB                                            CAN_FCTRL_CAN2SB_Msk                                           /*!<CAN2 start bank */

/*******************  Bit definition for CAN_FMCFG register  *******************/
#define CAN_FMCFG_FMCFG_Pos                                         (0U)
#define CAN_FMCFG_FMCFG_Msk                                         (0xFFFFFFFUL << CAN_FMCFG_FMCFG_Pos)                           /*!< 0x0FFFFFFF */
#define CAN_FMCFG_FMCFG                                             CAN_FMCFG_FMCFG_Msk                                            /*!<Filter Mode */
#define CAN_FMCFG_FMCFG0_Pos                                        (0U)
#define CAN_FMCFG_FMCFG0_Msk                                        (0x1UL << CAN_FMCFG_FMCFG0_Pos)                                /*!< 0x00000001 */
#define CAN_FMCFG_FMCFG0                                            CAN_FMCFG_FMCFG0_Msk                                           /*!<Filter Init Mode bit 0 */
#define CAN_FMCFG_FMCFG1_Pos                                        (1U)
#define CAN_FMCFG_FMCFG1_Msk                                        (0x1UL << CAN_FMCFG_FMCFG1_Pos)                                /*!< 0x00000002 */
#define CAN_FMCFG_FMCFG1                                            CAN_FMCFG_FMCFG1_Msk                                           /*!<Filter Init Mode bit 1 */
#define CAN_FMCFG_FMCFG2_Pos                                        (2U)
#define CAN_FMCFG_FMCFG2_Msk                                        (0x1UL << CAN_FMCFG_FMCFG2_Pos)                                /*!< 0x00000004 */
#define CAN_FMCFG_FMCFG2                                            CAN_FMCFG_FMCFG2_Msk                                           /*!<Filter Init Mode bit 2 */
#define CAN_FMCFG_FMCFG3_Pos                                        (3U)
#define CAN_FMCFG_FMCFG3_Msk                                        (0x1UL << CAN_FMCFG_FMCFG3_Pos)                                /*!< 0x00000008 */
#define CAN_FMCFG_FMCFG3                                            CAN_FMCFG_FMCFG3_Msk                                           /*!<Filter Init Mode bit 3 */
#define CAN_FMCFG_FMCFG4_Pos                                        (4U)
#define CAN_FMCFG_FMCFG4_Msk                                        (0x1UL << CAN_FMCFG_FMCFG4_Pos)                                /*!< 0x00000010 */
#define CAN_FMCFG_FMCFG4                                            CAN_FMCFG_FMCFG4_Msk                                           /*!<Filter Init Mode bit 4 */
#define CAN_FMCFG_FMCFG5_Pos                                        (5U)
#define CAN_FMCFG_FMCFG5_Msk                                        (0x1UL << CAN_FMCFG_FMCFG5_Pos)                                /*!< 0x00000020 */
#define CAN_FMCFG_FMCFG5                                            CAN_FMCFG_FMCFG5_Msk                                           /*!<Filter Init Mode bit 5 */
#define CAN_FMCFG_FMCFG6_Pos                                        (6U)
#define CAN_FMCFG_FMCFG6_Msk                                        (0x1UL << CAN_FMCFG_FMCFG6_Pos)                                /*!< 0x00000040 */
#define CAN_FMCFG_FMCFG6                                            CAN_FMCFG_FMCFG6_Msk                                           /*!<Filter Init Mode bit 6 */
#define CAN_FMCFG_FMCFG7_Pos                                        (7U)
#define CAN_FMCFG_FMCFG7_Msk                                        (0x1UL << CAN_FMCFG_FMCFG7_Pos)                                /*!< 0x00000080 */
#define CAN_FMCFG_FMCFG7                                            CAN_FMCFG_FMCFG7_Msk                                           /*!<Filter Init Mode bit 7 */
#define CAN_FMCFG_FMCFG8_Pos                                        (8U)
#define CAN_FMCFG_FMCFG8_Msk                                        (0x1UL << CAN_FMCFG_FMCFG8_Pos)                                /*!< 0x00000100 */
#define CAN_FMCFG_FMCFG8                                            CAN_FMCFG_FMCFG8_Msk                                           /*!<Filter Init Mode bit 8 */
#define CAN_FMCFG_FMCFG9_Pos                                        (9U)
#define CAN_FMCFG_FMCFG9_Msk                                        (0x1UL << CAN_FMCFG_FMCFG9_Pos)                                /*!< 0x00000200 */
#define CAN_FMCFG_FMCFG9                                            CAN_FMCFG_FMCFG9_Msk                                           /*!<Filter Init Mode bit 9 */
#define CAN_FMCFG_FMCFG10_Pos                                       (10U)
#define CAN_FMCFG_FMCFG10_Msk                                       (0x1UL << CAN_FMCFG_FMCFG10_Pos)                               /*!< 0x00000400 */
#define CAN_FMCFG_FMCFG10                                           CAN_FMCFG_FMCFG10_Msk                                          /*!<Filter Init Mode bit 10 */
#define CAN_FMCFG_FMCFG11_Pos                                       (11U)
#define CAN_FMCFG_FMCFG11_Msk                                       (0x1UL << CAN_FMCFG_FMCFG11_Pos)                               /*!< 0x00000800 */
#define CAN_FMCFG_FMCFG11                                           CAN_FMCFG_FMCFG11_Msk                                          /*!<Filter Init Mode bit 11 */
#define CAN_FMCFG_FMCFG12_Pos                                       (12U)
#define CAN_FMCFG_FMCFG12_Msk                                       (0x1UL << CAN_FMCFG_FMCFG12_Pos)                               /*!< 0x00001000 */
#define CAN_FMCFG_FMCFG12                                           CAN_FMCFG_FMCFG12_Msk                                          /*!<Filter Init Mode bit 12 */
#define CAN_FMCFG_FMCFG13_Pos                                       (13U)
#define CAN_FMCFG_FMCFG13_Msk                                       (0x1UL << CAN_FMCFG_FMCFG13_Pos)                               /*!< 0x00002000 */
#define CAN_FMCFG_FMCFG13                                           CAN_FMCFG_FMCFG13_Msk                                          /*!<Filter Init Mode bit 13 */
#define CAN_FMCFG_FMCFG14_Pos                                       (14U)
#define CAN_FMCFG_FMCFG14_Msk                                       (0x1UL << CAN_FMCFG_FMCFG14_Pos)                               /*!< 0x00004000 */
#define CAN_FMCFG_FMCFG14                                           CAN_FMCFG_FMCFG14_Msk                                          /*!<Filter Init Mode bit 14 */
#define CAN_FMCFG_FMCFG15_Pos                                       (15U)
#define CAN_FMCFG_FMCFG15_Msk                                       (0x1UL << CAN_FMCFG_FMCFG15_Pos)                               /*!< 0x00008000 */
#define CAN_FMCFG_FMCFG15                                           CAN_FMCFG_FMCFG15_Msk                                          /*!<Filter Init Mode bit 15 */
#define CAN_FMCFG_FMCFG16_Pos                                       (16U)
#define CAN_FMCFG_FMCFG16_Msk                                       (0x1UL << CAN_FMCFG_FMCFG16_Pos)                               /*!< 0x00010000 */
#define CAN_FMCFG_FMCFG16                                           CAN_FMCFG_FMCFG16_Msk                                          /*!<Filter Init Mode bit 16 */
#define CAN_FMCFG_FMCFG17_Pos                                       (17U)
#define CAN_FMCFG_FMCFG17_Msk                                       (0x1UL << CAN_FMCFG_FMCFG17_Pos)                               /*!< 0x00020000 */
#define CAN_FMCFG_FMCFG17                                           CAN_FMCFG_FMCFG17_Msk                                          /*!<Filter Init Mode bit 17 */
#define CAN_FMCFG_FMCFG18_Pos                                       (18U)
#define CAN_FMCFG_FMCFG18_Msk                                       (0x1UL << CAN_FMCFG_FMCFG18_Pos)                               /*!< 0x00040000 */
#define CAN_FMCFG_FMCFG18                                           CAN_FMCFG_FMCFG18_Msk                                          /*!<Filter Init Mode bit 18 */
#define CAN_FMCFG_FMCFG19_Pos                                       (19U)
#define CAN_FMCFG_FMCFG19_Msk                                       (0x1UL << CAN_FMCFG_FMCFG19_Pos)                               /*!< 0x00080000 */
#define CAN_FMCFG_FMCFG19                                           CAN_FMCFG_FMCFG19_Msk                                          /*!<Filter Init Mode bit 19 */
#define CAN_FMCFG_FMCFG20_Pos                                       (20U)
#define CAN_FMCFG_FMCFG20_Msk                                       (0x1UL << CAN_FMCFG_FMCFG20_Pos)                               /*!< 0x00100000 */
#define CAN_FMCFG_FMCFG20                                           CAN_FMCFG_FMCFG20_Msk                                          /*!<Filter Init Mode bit 20 */
#define CAN_FMCFG_FMCFG21_Pos                                       (21U)
#define CAN_FMCFG_FMCFG21_Msk                                       (0x1UL << CAN_FMCFG_FMCFG21_Pos)                               /*!< 0x00200000 */
#define CAN_FMCFG_FMCFG21                                           CAN_FMCFG_FMCFG21_Msk                                          /*!<Filter Init Mode bit 21 */
#define CAN_FMCFG_FMCFG22_Pos                                       (22U)
#define CAN_FMCFG_FMCFG22_Msk                                       (0x1UL << CAN_FMCFG_FMCFG22_Pos)                               /*!< 0x00400000 */
#define CAN_FMCFG_FMCFG22                                           CAN_FMCFG_FMCFG22_Msk                                          /*!<Filter Init Mode bit 22 */
#define CAN_FMCFG_FMCFG23_Pos                                       (23U)
#define CAN_FMCFG_FMCFG23_Msk                                       (0x1UL << CAN_FMCFG_FMCFG23_Pos)                               /*!< 0x00800000 */
#define CAN_FMCFG_FMCFG23                                           CAN_FMCFG_FMCFG23_Msk                                          /*!<Filter Init Mode bit 23 */
#define CAN_FMCFG_FMCFG24_Pos                                       (24U)
#define CAN_FMCFG_FMCFG24_Msk                                       (0x1UL << CAN_FMCFG_FMCFG24_Pos)                               /*!< 0x01000000 */
#define CAN_FMCFG_FMCFG24                                           CAN_FMCFG_FMCFG24_Msk                                          /*!<Filter Init Mode bit 24 */
#define CAN_FMCFG_FMCFG25_Pos                                       (25U)
#define CAN_FMCFG_FMCFG25_Msk                                       (0x1UL << CAN_FMCFG_FMCFG25_Pos)                               /*!< 0x02000000 */
#define CAN_FMCFG_FMCFG25                                           CAN_FMCFG_FMCFG25_Msk                                          /*!<Filter Init Mode bit 25 */
#define CAN_FMCFG_FMCFG26_Pos                                       (26U)
#define CAN_FMCFG_FMCFG26_Msk                                       (0x1UL << CAN_FMCFG_FMCFG26_Pos)                               /*!< 0x04000000 */
#define CAN_FMCFG_FMCFG26                                           CAN_FMCFG_FMCFG26_Msk                                          /*!<Filter Init Mode bit 26 */
#define CAN_FMCFG_FMCFG27_Pos                                       (27U)
#define CAN_FMCFG_FMCFG27_Msk                                       (0x1UL << CAN_FMCFG_FMCFG27_Pos)                               /*!< 0x08000000 */
#define CAN_FMCFG_FMCFG27                                           CAN_FMCFG_FMCFG27_Msk                                          /*!<Filter Init Mode bit 27 */

