kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/* Legacy defines */
#define GPIO_PUPD_PUPDR0                                            GPIO_PUPD_PUPD0
#define GPIO_PUPD_PUPDR0_0                                          GPIO_PUPD_PUPD0_0
#define GPIO_PUPD_PUPDR0_1                                          GPIO_PUPD_PUPD0_1
#define GPIO_PUPD_PUPDR1                                            GPIO_PUPD_PUPD1
#define GPIO_PUPD_PUPDR1_0                                          GPIO_PUPD_PUPD1_0
#define GPIO_PUPD_PUPDR1_1                                          GPIO_PUPD_PUPD1_1
#define GPIO_PUPD_PUPDR2                                            GPIO_PUPD_PUPD2
#define GPIO_PUPD_PUPDR2_0                                          GPIO_PUPD_PUPD2_0
#define GPIO_PUPD_PUPDR2_1                                          GPIO_PUPD_PUPD2_1
#define GPIO_PUPD_PUPDR3                                            GPIO_PUPD_PUPD3
#define GPIO_PUPD_PUPDR3_0                                          GPIO_PUPD_PUPD3_0
#define GPIO_PUPD_PUPDR3_1                                          GPIO_PUPD_PUPD3_1
#define GPIO_PUPD_PUPDR4                                            GPIO_PUPD_PUPD4
#define GPIO_PUPD_PUPDR4_0                                          GPIO_PUPD_PUPD4_0
#define GPIO_PUPD_PUPDR4_1                                          GPIO_PUPD_PUPD4_1
#define GPIO_PUPD_PUPDR5                                            GPIO_PUPD_PUPD5
#define GPIO_PUPD_PUPDR5_0                                          GPIO_PUPD_PUPD5_0
#define GPIO_PUPD_PUPDR5_1                                          GPIO_PUPD_PUPD5_1
#define GPIO_PUPD_PUPDR6                                            GPIO_PUPD_PUPD6
#define GPIO_PUPD_PUPDR6_0                                          GPIO_PUPD_PUPD6_0
#define GPIO_PUPD_PUPDR6_1                                          GPIO_PUPD_PUPD6_1
#define GPIO_PUPD_PUPDR7                                            GPIO_PUPD_PUPD7
#define GPIO_PUPD_PUPDR7_0                                          GPIO_PUPD_PUPD7_0
#define GPIO_PUPD_PUPDR7_1                                          GPIO_PUPD_PUPD7_1
#define GPIO_PUPD_PUPDR8                                            GPIO_PUPD_PUPD8
#define GPIO_PUPD_PUPDR8_0                                          GPIO_PUPD_PUPD8_0
#define GPIO_PUPD_PUPDR8_1                                          GPIO_PUPD_PUPD8_1
#define GPIO_PUPD_PUPDR9                                            GPIO_PUPD_PUPD9
#define GPIO_PUPD_PUPDR9_0                                          GPIO_PUPD_PUPD9_0
#define GPIO_PUPD_PUPDR9_1                                          GPIO_PUPD_PUPD9_1
#define GPIO_PUPD_PUPDR10                                           GPIO_PUPD_PUPD10
#define GPIO_PUPD_PUPDR10_0                                         GPIO_PUPD_PUPD10_0
#define GPIO_PUPD_PUPDR10_1                                         GPIO_PUPD_PUPD10_1
#define GPIO_PUPD_PUPDR11                                           GPIO_PUPD_PUPD11
#define GPIO_PUPD_PUPDR11_0                                         GPIO_PUPD_PUPD11_0
#define GPIO_PUPD_PUPDR11_1                                         GPIO_PUPD_PUPD11_1
#define GPIO_PUPD_PUPDR12                                           GPIO_PUPD_PUPD12
#define GPIO_PUPD_PUPDR12_0                                         GPIO_PUPD_PUPD12_0
#define GPIO_PUPD_PUPDR12_1                                         GPIO_PUPD_PUPD12_1
#define GPIO_PUPD_PUPDR13                                           GPIO_PUPD_PUPD13
#define GPIO_PUPD_PUPDR13_0                                         GPIO_PUPD_PUPD13_0
#define GPIO_PUPD_PUPDR13_1                                         GPIO_PUPD_PUPD13_1
#define GPIO_PUPD_PUPDR14                                           GPIO_PUPD_PUPD14
#define GPIO_PUPD_PUPDR14_0                                         GPIO_PUPD_PUPD14_0
#define GPIO_PUPD_PUPDR14_1                                         GPIO_PUPD_PUPD14_1
#define GPIO_PUPD_PUPDR15                                           GPIO_PUPD_PUPD15
#define GPIO_PUPD_PUPDR15_0                                         GPIO_PUPD_PUPD15_0
#define GPIO_PUPD_PUPDR15_1                                         GPIO_PUPD_PUPD15_1

/******************  Bits definition for GPIO_IDATA register  *******************/
#define GPIO_IDATA_IDATA0_Pos                                       (0U)
#define GPIO_IDATA_IDATA0_Msk                                       (0x1UL << GPIO_IDATA_IDATA0_Pos)                               /*!< 0x00000001 */
#define GPIO_IDATA_IDATA0                                           GPIO_IDATA_IDATA0_Msk
#define GPIO_IDATA_IDATA1_Pos                                       (1U)
#define GPIO_IDATA_IDATA1_Msk                                       (0x1UL << GPIO_IDATA_IDATA1_Pos)                               /*!< 0x00000002 */
#define GPIO_IDATA_IDATA1                                           GPIO_IDATA_IDATA1_Msk
#define GPIO_IDATA_IDATA2_Pos                                       (2U)
#define GPIO_IDATA_IDATA2_Msk                                       (0x1UL << GPIO_IDATA_IDATA2_Pos)                               /*!< 0x00000004 */
#define GPIO_IDATA_IDATA2                                           GPIO_IDATA_IDATA2_Msk
#define GPIO_IDATA_IDATA3_Pos                                       (3U)
#define GPIO_IDATA_IDATA3_Msk                                       (0x1UL << GPIO_IDATA_IDATA3_Pos)                               /*!< 0x00000008 */
#define GPIO_IDATA_IDATA3                                           GPIO_IDATA_IDATA3_Msk
#define GPIO_IDATA_IDATA4_Pos                                       (4U)
#define GPIO_IDATA_IDATA4_Msk                                       (0x1UL << GPIO_IDATA_IDATA4_Pos)                               /*!< 0x00000010 */
#define GPIO_IDATA_IDATA4                                           GPIO_IDATA_IDATA4_Msk
#define GPIO_IDATA_IDATA5_Pos                                       (5U)
#define GPIO_IDATA_IDATA5_Msk                                       (0x1UL << GPIO_IDATA_IDATA5_Pos)                               /*!< 0x00000020 */
#define GPIO_IDATA_IDATA5                                           GPIO_IDATA_IDATA5_Msk
#define GPIO_IDATA_IDATA6_Pos                                       (6U)
#define GPIO_IDATA_IDATA6_Msk                                       (0x1UL << GPIO_IDATA_IDATA6_Pos)                               /*!< 0x00000040 */
#define GPIO_IDATA_IDATA6                                           GPIO_IDATA_IDATA6_Msk
#define GPIO_IDATA_IDATA7_Pos                                       (7U)
#define GPIO_IDATA_IDATA7_Msk                                       (0x1UL << GPIO_IDATA_IDATA7_Pos)                               /*!< 0x00000080 */
#define GPIO_IDATA_IDATA7                                           GPIO_IDATA_IDATA7_Msk
#define GPIO_IDATA_IDATA8_Pos                                       (8U)
#define GPIO_IDATA_IDATA8_Msk                                       (0x1UL << GPIO_IDATA_IDATA8_Pos)                               /*!< 0x00000100 */
#define GPIO_IDATA_IDATA8                                           GPIO_IDATA_IDATA8_Msk
#define GPIO_IDATA_IDATA9_Pos                                       (9U)
#define GPIO_IDATA_IDATA9_Msk                                       (0x1UL << GPIO_IDATA_IDATA9_Pos)                               /*!< 0x00000200 */
#define GPIO_IDATA_IDATA9                                           GPIO_IDATA_IDATA9_Msk
#define GPIO_IDATA_IDATA10_Pos                                      (10U)
#define GPIO_IDATA_IDATA10_Msk                                      (0x1UL << GPIO_IDATA_IDATA10_Pos)                              /*!< 0x00000400 */
#define GPIO_IDATA_IDATA10                                          GPIO_IDATA_IDATA10_Msk
#define GPIO_IDATA_IDATA11_Pos                                      (11U)
#define GPIO_IDATA_IDATA11_Msk                                      (0x1UL << GPIO_IDATA_IDATA11_Pos)                              /*!< 0x00000800 */
#define GPIO_IDATA_IDATA11                                          GPIO_IDATA_IDATA11_Msk
#define GPIO_IDATA_IDATA12_Pos                                      (12U)
#define GPIO_IDATA_IDATA12_Msk                                      (0x1UL << GPIO_IDATA_IDATA12_Pos)                              /*!< 0x00001000 */
#define GPIO_IDATA_IDATA12                                          GPIO_IDATA_IDATA12_Msk
#define GPIO_IDATA_IDATA13_Pos                                      (13U)
#define GPIO_IDATA_IDATA13_Msk                                      (0x1UL << GPIO_IDATA_IDATA13_Pos)                              /*!< 0x00002000 */
#define GPIO_IDATA_IDATA13                                          GPIO_IDATA_IDATA13_Msk
#define GPIO_IDATA_IDATA14_Pos                                      (14U)
#define GPIO_IDATA_IDATA14_Msk                                      (0x1UL << GPIO_IDATA_IDATA14_Pos)                              /*!< 0x00004000 */
#define GPIO_IDATA_IDATA14                                          GPIO_IDATA_IDATA14_Msk
#define GPIO_IDATA_IDATA15_Pos                                      (15U)
#define GPIO_IDATA_IDATA15_Msk                                      (0x1UL << GPIO_IDATA_IDATA15_Pos)                              /*!< 0x00008000 */
#define GPIO_IDATA_IDATA15                                          GPIO_IDATA_IDATA15_Msk

