kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/********************  Bit definition for RCM_AHB1CLKEN register  ***************/
#define RCM_AHB1CLKEN_PAEN_Pos                                      (0U)
#define RCM_AHB1CLKEN_PAEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PAEN_Pos)                              /*!< 0x00000001 */
#define RCM_AHB1CLKEN_PAEN                                          RCM_AHB1CLKEN_PAEN_Msk
#define RCM_AHB1CLKEN_PBEN_Pos                                      (1U)
#define RCM_AHB1CLKEN_PBEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PBEN_Pos)                              /*!< 0x00000002 */
#define RCM_AHB1CLKEN_PBEN                                          RCM_AHB1CLKEN_PBEN_Msk
#define RCM_AHB1CLKEN_PCEN_Pos                                      (2U)
#define RCM_AHB1CLKEN_PCEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PCEN_Pos)                              /*!< 0x00000004 */
#define RCM_AHB1CLKEN_PCEN                                          RCM_AHB1CLKEN_PCEN_Msk
#define RCM_AHB1CLKEN_PDEN_Pos                                      (3U)
#define RCM_AHB1CLKEN_PDEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PDEN_Pos)                              /*!< 0x00000008 */
#define RCM_AHB1CLKEN_PDEN                                          RCM_AHB1CLKEN_PDEN_Msk
#define RCM_AHB1CLKEN_PEEN_Pos                                      (4U)
#define RCM_AHB1CLKEN_PEEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PEEN_Pos)                              /*!< 0x00000010 */
#define RCM_AHB1CLKEN_PEEN                                          RCM_AHB1CLKEN_PEEN_Msk
#define RCM_AHB1CLKEN_PFEN_Pos                                      (5U)
#define RCM_AHB1CLKEN_PFEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PFEN_Pos)                              /*!< 0x00000020 */
#define RCM_AHB1CLKEN_PFEN                                          RCM_AHB1CLKEN_PFEN_Msk
#define RCM_AHB1CLKEN_PGEN_Pos                                      (6U)
#define RCM_AHB1CLKEN_PGEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PGEN_Pos)                              /*!< 0x00000040 */
#define RCM_AHB1CLKEN_PGEN                                          RCM_AHB1CLKEN_PGEN_Msk
#define RCM_AHB1CLKEN_PHEN_Pos                                      (7U)
#define RCM_AHB1CLKEN_PHEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PHEN_Pos)                              /*!< 0x00000080 */
#define RCM_AHB1CLKEN_PHEN                                          RCM_AHB1CLKEN_PHEN_Msk
#define RCM_AHB1CLKEN_PIEN_Pos                                      (8U)
#define RCM_AHB1CLKEN_PIEN_Msk                                      (0x1UL << RCM_AHB1CLKEN_PIEN_Pos)                              /*!< 0x00000100 */
#define RCM_AHB1CLKEN_PIEN                                          RCM_AHB1CLKEN_PIEN_Msk
#define RCM_AHB1CLKEN_CRCEN_Pos                                     (12U)
#define RCM_AHB1CLKEN_CRCEN_Msk                                     (0x1UL << RCM_AHB1CLKEN_CRCEN_Pos)                             /*!< 0x00001000 */
#define RCM_AHB1CLKEN_CRCEN                                         RCM_AHB1CLKEN_CRCEN_Msk
#define RCM_AHB1CLKEN_BKPSRAMEN_Pos                                 (18U)
#define RCM_AHB1CLKEN_BKPSRAMEN_Msk                                 (0x1UL << RCM_AHB1CLKEN_BKPSRAMEN_Pos)                         /*!< 0x00040000 */
#define RCM_AHB1CLKEN_BKPSRAMEN                                     RCM_AHB1CLKEN_BKPSRAMEN_Msk
#define RCM_AHB1CLKEN_DRAMEN_Pos                                    (20U)
#define RCM_AHB1CLKEN_DRAMEN_Msk                                    (0x1UL << RCM_AHB1CLKEN_DRAMEN_Pos)                            /*!< 0x00100000 */
#define RCM_AHB1CLKEN_DRAMEN                                        RCM_AHB1CLKEN_DRAMEN_Msk
#define RCM_AHB1CLKEN_DMA1EN_Pos                                    (21U)
#define RCM_AHB1CLKEN_DMA1EN_Msk                                    (0x1UL << RCM_AHB1CLKEN_DMA1EN_Pos)                            /*!< 0x00200000 */
#define RCM_AHB1CLKEN_DMA1EN                                        RCM_AHB1CLKEN_DMA1EN_Msk
#define RCM_AHB1CLKEN_DMA2EN_Pos                                    (22U)
#define RCM_AHB1CLKEN_DMA2EN_Msk                                    (0x1UL << RCM_AHB1CLKEN_DMA2EN_Pos)                            /*!< 0x00400000 */
#define RCM_AHB1CLKEN_DMA2EN                                        RCM_AHB1CLKEN_DMA2EN_Msk
#define RCM_AHB1CLKEN_ETHEN_Pos                                     (25U)
#define RCM_AHB1CLKEN_ETHEN_Msk                                     (0x1UL << RCM_AHB1CLKEN_ETHEN_Pos)                             /*!< 0x02000000 */
#define RCM_AHB1CLKEN_ETHEN                                         RCM_AHB1CLKEN_ETHEN_Msk
#define RCM_AHB1CLKEN_ETHTXEN_Pos                                   (26U)
#define RCM_AHB1CLKEN_ETHTXEN_Msk                                   (0x1UL << RCM_AHB1CLKEN_ETHTXEN_Pos)                           /*!< 0x04000000 */
#define RCM_AHB1CLKEN_ETHTXEN                                       RCM_AHB1CLKEN_ETHTXEN_Msk
#define RCM_AHB1CLKEN_ETHRXEN_Pos                                   (27U)
#define RCM_AHB1CLKEN_ETHRXEN_Msk                                   (0x1UL << RCM_AHB1CLKEN_ETHRXEN_Pos)                           /*!< 0x08000000 */
#define RCM_AHB1CLKEN_ETHRXEN                                       RCM_AHB1CLKEN_ETHRXEN_Msk
#define RCM_AHB1CLKEN_ETHPTPEN_Pos                                  (28U)
#define RCM_AHB1CLKEN_ETHPTPEN_Msk                                  (0x1UL << RCM_AHB1CLKEN_ETHPTPEN_Pos)                          /*!< 0x10000000 */
#define RCM_AHB1CLKEN_ETHPTPEN                                      RCM_AHB1CLKEN_ETHPTPEN_Msk
#define RCM_AHB1CLKEN_OTGHS1EN_Pos                                  (29U)
#define RCM_AHB1CLKEN_OTGHS1EN_Msk                                  (0x1UL << RCM_AHB1CLKEN_OTGHS1EN_Pos)                          /*!< 0x20000000 */
#define RCM_AHB1CLKEN_OTGHS1EN                                      RCM_AHB1CLKEN_OTGHS1EN_Msk
#define RCM_AHB1CLKEN_OTGHSULPIEN_Pos                               (30U)
#define RCM_AHB1CLKEN_OTGHSULPIEN_Msk                               (0x1UL << RCM_AHB1CLKEN_OTGHSULPIEN_Pos)                       /*!< 0x40000000 */
#define RCM_AHB1CLKEN_OTGHSULPIEN                                   RCM_AHB1CLKEN_OTGHSULPIEN_Msk
/********************  Bit definition for RCM_AHB2CLKEN register  ***************/
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_AHB2_SUPPORT                                                                                                           /*!< AHB2 Bus is supported */

#define RCM_AHB2CLKEN_FPUEN_Pos                                     (1U)
#define RCM_AHB2CLKEN_FPUEN_Msk                                     (0x1UL << RCM_AHB2CLKEN_FPUEN_Pos)                             /*!< 0x00000001 */
#define RCM_AHB2CLKEN_FPUEN                                         RCM_AHB2CLKEN_FPUEN_Msk
#define RCM_AHB2CLKEN_BNEN_Pos                                      (2U)
#define RCM_AHB2CLKEN_BNEN_Msk                                      (0x1UL << RCM_AHB2CLKEN_BNEN_Pos)                              /*!< 0x00000001 */
#define RCM_AHB2CLKEN_BNEN                                          RCM_AHB2CLKEN_BNEN_Msk
#define RCM_AHB2CLKEN_SMEN_Pos                                      (3U)
#define RCM_AHB2CLKEN_SMEN_Msk                                      (0x1UL << RCM_AHB2CLKEN_SMEN_Pos)                              /*!< 0x00000001 */
#define RCM_AHB2CLKEN_SMEN                                          RCM_AHB2CLKEN_SMEN_Msk
#define RCM_AHB2CLKEN_CRYPEN_Pos                                    (4U)
#define RCM_AHB2CLKEN_CRYPEN_Msk                                    (0x1UL << RCM_AHB2CLKEN_CRYPEN_Pos)                            /*!< 0x00000010 */
#define RCM_AHB2CLKEN_CRYPEN                                        RCM_AHB2CLKEN_CRYPEN_Msk
#define RCM_AHB2CLKEN_HASHEN_Pos                                    (5U)
#define RCM_AHB2CLKEN_HASHEN_Msk                                    (0x1UL << RCM_AHB2CLKEN_HASHEN_Pos)                            /*!< 0x00000020 */
#define RCM_AHB2CLKEN_HASHEN                                        RCM_AHB2CLKEN_HASHEN_Msk
#define RCM_AHB2CLKEN_RNGEN_Pos                                     (6U)
#define RCM_AHB2CLKEN_RNGEN_Msk                                     (0x1UL << RCM_AHB2CLKEN_RNGEN_Pos)                             /*!< 0x00000040 */
#define RCM_AHB2CLKEN_RNGEN                                         RCM_AHB2CLKEN_RNGEN_Msk
#define RCM_AHB2CLKEN_OTGFSEN_Pos                                   (7U)
#define RCM_AHB2CLKEN_OTGFSEN_Msk                                   (0x1UL << RCM_AHB2CLKEN_OTGFSEN_Pos)                           /*!< 0x00000080 */
#define RCM_AHB2CLKEN_OTGFSEN                                       RCM_AHB2CLKEN_OTGFSEN_Msk

