kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/********************  Bit definition for RCM_AHB3CLKEN register  ***************/
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_AHB3_SUPPORT                                                                                                           /*!< AHB3 Bus is supported */

#define RCM_AHB3CLKEN_EMMCEN_Pos                                    (0U)
#define RCM_AHB3CLKEN_EMMCEN_Msk                                    (0x1UL << RCM_AHB3CLKEN_EMMCEN_Pos)                            /*!< 0x00000001 */
#define RCM_AHB3CLKEN_EMMCEN                                        RCM_AHB3CLKEN_EMMCEN_Msk

/********************  Bit definition for RCM_APB1CLKEN register  ***************/
#define RCM_APB1CLKEN_TMR2EN_Pos                                    (0U)
#define RCM_APB1CLKEN_TMR2EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR2EN_Pos)                            /*!< 0x00000001 */
#define RCM_APB1CLKEN_TMR2EN                                        RCM_APB1CLKEN_TMR2EN_Msk
#define RCM_APB1CLKEN_TMR3EN_Pos                                    (1U)
#define RCM_APB1CLKEN_TMR3EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR3EN_Pos)                            /*!< 0x00000002 */
#define RCM_APB1CLKEN_TMR3EN                                        RCM_APB1CLKEN_TMR3EN_Msk
#define RCM_APB1CLKEN_TMR4EN_Pos                                    (2U)
#define RCM_APB1CLKEN_TMR4EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR4EN_Pos)                            /*!< 0x00000004 */
#define RCM_APB1CLKEN_TMR4EN                                        RCM_APB1CLKEN_TMR4EN_Msk
#define RCM_APB1CLKEN_TMR5EN_Pos                                    (3U)
#define RCM_APB1CLKEN_TMR5EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR5EN_Pos)                            /*!< 0x00000008 */
#define RCM_APB1CLKEN_TMR5EN                                        RCM_APB1CLKEN_TMR5EN_Msk
#define RCM_APB1CLKEN_TMR6EN_Pos                                    (4U)
#define RCM_APB1CLKEN_TMR6EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR6EN_Pos)                            /*!< 0x00000010 */
#define RCM_APB1CLKEN_TMR6EN                                        RCM_APB1CLKEN_TMR6EN_Msk
#define RCM_APB1CLKEN_TMR7EN_Pos                                    (5U)
#define RCM_APB1CLKEN_TMR7EN_Msk                                    (0x1UL << RCM_APB1CLKEN_TMR7EN_Pos)                            /*!< 0x00000020 */
#define RCM_APB1CLKEN_TMR7EN                                        RCM_APB1CLKEN_TMR7EN_Msk
#define RCM_APB1CLKEN_TMR12EN_Pos                                   (6U)
#define RCM_APB1CLKEN_TMR12EN_Msk                                   (0x1UL << RCM_APB1CLKEN_TMR12EN_Pos)                           /*!< 0x00000040 */
#define RCM_APB1CLKEN_TMR12EN                                       RCM_APB1CLKEN_TMR12EN_Msk
#define RCM_APB1CLKEN_TMR13EN_Pos                                   (7U)
#define RCM_APB1CLKEN_TMR13EN_Msk                                   (0x1UL << RCM_APB1CLKEN_TMR13EN_Pos)                           /*!< 0x00000080 */
#define RCM_APB1CLKEN_TMR13EN                                       RCM_APB1CLKEN_TMR13EN_Msk
#define RCM_APB1CLKEN_TMR14EN_Pos                                   (8U)
#define RCM_APB1CLKEN_TMR14EN_Msk                                   (0x1UL << RCM_APB1CLKEN_TMR14EN_Pos)                           /*!< 0x00000100 */
#define RCM_APB1CLKEN_TMR14EN                                       RCM_APB1CLKEN_TMR14EN_Msk
#define RCM_APB1CLKEN_WWDTEN_Pos                                    (11U)
#define RCM_APB1CLKEN_WWDTEN_Msk                                    (0x1UL << RCM_APB1CLKEN_WWDTEN_Pos)                            /*!< 0x00000800 */
#define RCM_APB1CLKEN_WWDTEN                                        RCM_APB1CLKEN_WWDTEN_Msk
#define RCM_APB1CLKEN_SPI2EN_Pos                                    (14U)
#define RCM_APB1CLKEN_SPI2EN_Msk                                    (0x1UL << RCM_APB1CLKEN_SPI2EN_Pos)                            /*!< 0x00004000 */
#define RCM_APB1CLKEN_SPI2EN                                        RCM_APB1CLKEN_SPI2EN_Msk
#define RCM_APB1CLKEN_SPI3EN_Pos                                    (15U)
#define RCM_APB1CLKEN_SPI3EN_Msk                                    (0x1UL << RCM_APB1CLKEN_SPI3EN_Pos)                            /*!< 0x00008000 */
#define RCM_APB1CLKEN_SPI3EN                                        RCM_APB1CLKEN_SPI3EN_Msk
#define RCM_APB1CLKEN_USART2EN_Pos                                  (17U)
#define RCM_APB1CLKEN_USART2EN_Msk                                  (0x1UL << RCM_APB1CLKEN_USART2EN_Pos)                          /*!< 0x00020000 */
#define RCM_APB1CLKEN_USART2EN                                      RCM_APB1CLKEN_USART2EN_Msk
#define RCM_APB1CLKEN_USART3EN_Pos                                  (18U)
#define RCM_APB1CLKEN_USART3EN_Msk                                  (0x1UL << RCM_APB1CLKEN_USART3EN_Pos)                          /*!< 0x00040000 */
#define RCM_APB1CLKEN_USART3EN                                      RCM_APB1CLKEN_USART3EN_Msk
#define RCM_APB1CLKEN_UART4EN_Pos                                   (19U)
#define RCM_APB1CLKEN_UART4EN_Msk                                   (0x1UL << RCM_APB1CLKEN_UART4EN_Pos)                           /*!< 0x00080000 */
#define RCM_APB1CLKEN_UART4EN                                       RCM_APB1CLKEN_UART4EN_Msk
#define RCM_APB1CLKEN_UART5EN_Pos                                   (20U)
#define RCM_APB1CLKEN_UART5EN_Msk                                   (0x1UL << RCM_APB1CLKEN_UART5EN_Pos)                           /*!< 0x00100000 */
#define RCM_APB1CLKEN_UART5EN                                       RCM_APB1CLKEN_UART5EN_Msk
#define RCM_APB1CLKEN_I2C1EN_Pos                                    (21U)
#define RCM_APB1CLKEN_I2C1EN_Msk                                    (0x1UL << RCM_APB1CLKEN_I2C1EN_Pos)                            /*!< 0x00200000 */
#define RCM_APB1CLKEN_I2C1EN                                        RCM_APB1CLKEN_I2C1EN_Msk
#define RCM_APB1CLKEN_I2C2EN_Pos                                    (22U)
#define RCM_APB1CLKEN_I2C2EN_Msk                                    (0x1UL << RCM_APB1CLKEN_I2C2EN_Pos)                            /*!< 0x00400000 */
#define RCM_APB1CLKEN_I2C2EN                                        RCM_APB1CLKEN_I2C2EN_Msk
#define RCM_APB1CLKEN_I2C3EN_Pos                                    (23U)
#define RCM_APB1CLKEN_I2C3EN_Msk                                    (0x1UL << RCM_APB1CLKEN_I2C3EN_Pos)                            /*!< 0x00800000 */
#define RCM_APB1CLKEN_I2C3EN                                        RCM_APB1CLKEN_I2C3EN_Msk
#define RCM_APB1CLKEN_CAN1EN_Pos                                    (25U)
#define RCM_APB1CLKEN_CAN1EN_Msk                                    (0x1UL << RCM_APB1CLKEN_CAN1EN_Pos)                            /*!< 0x02000000 */
#define RCM_APB1CLKEN_CAN1EN                                        RCM_APB1CLKEN_CAN1EN_Msk
#define RCM_APB1CLKEN_CAN2EN_Pos                                    (26U)
#define RCM_APB1CLKEN_CAN2EN_Msk                                    (0x1UL << RCM_APB1CLKEN_CAN2EN_Pos)                            /*!< 0x04000000 */
#define RCM_APB1CLKEN_CAN2EN                                        RCM_APB1CLKEN_CAN2EN_Msk
#define RCM_APB1CLKEN_PMUEN_Pos                                     (28U)
#define RCM_APB1CLKEN_PMUEN_Msk                                     (0x1UL << RCM_APB1CLKEN_PMUEN_Pos)                             /*!< 0x10000000 */
#define RCM_APB1CLKEN_PMUEN                                         RCM_APB1CLKEN_PMUEN_Msk
#define RCM_APB1CLKEN_DACEN_Pos                                     (29U)
#define RCM_APB1CLKEN_DACEN_Msk                                     (0x1UL << RCM_APB1CLKEN_DACEN_Pos)                             /*!< 0x20000000 */
#define RCM_APB1CLKEN_DACEN                                         RCM_APB1CLKEN_DACEN_Msk

/********************  Bit definition for RCM_APB2CLKEN register  ***************/
#define RCM_APB2CLKEN_TMR1EN_Pos                                    (0U)
#define RCM_APB2CLKEN_TMR1EN_Msk                                    (0x1UL << RCM_APB2CLKEN_TMR1EN_Pos)                            /*!< 0x00000001 */
#define RCM_APB2CLKEN_TMR1EN                                        RCM_APB2CLKEN_TMR1EN_Msk
#define RCM_APB2CLKEN_TMR8EN_Pos                                    (1U)
#define RCM_APB2CLKEN_TMR8EN_Msk                                    (0x1UL << RCM_APB2CLKEN_TMR8EN_Pos)                            /*!< 0x00000002 */
#define RCM_APB2CLKEN_TMR8EN                                        RCM_APB2CLKEN_TMR8EN_Msk
#define RCM_APB2CLKEN_USART1EN_Pos                                  (4U)
#define RCM_APB2CLKEN_USART1EN_Msk                                  (0x1UL << RCM_APB2CLKEN_USART1EN_Pos)                          /*!< 0x00000010 */
#define RCM_APB2CLKEN_USART1EN                                      RCM_APB2CLKEN_USART1EN_Msk
#define RCM_APB2CLKEN_USART6EN_Pos                                  (5U)
#define RCM_APB2CLKEN_USART6EN_Msk                                  (0x1UL << RCM_APB2CLKEN_USART6EN_Pos)                          /*!< 0x00000020 */
#define RCM_APB2CLKEN_USART6EN                                      RCM_APB2CLKEN_USART6EN_Msk
#define RCM_APB2CLKEN_ADC1EN_Pos                                    (8U)
#define RCM_APB2CLKEN_ADC1EN_Msk                                    (0x1UL << RCM_APB2CLKEN_ADC1EN_Pos)                            /*!< 0x00000100 */
#define RCM_APB2CLKEN_ADC1EN                                        RCM_APB2CLKEN_ADC1EN_Msk
#define RCM_APB2CLKEN_ADC2EN_Pos                                    (9U)
#define RCM_APB2CLKEN_ADC2EN_Msk                                    (0x1UL << RCM_APB2CLKEN_ADC2EN_Pos)                            /*!< 0x00000200 */
#define RCM_APB2CLKEN_ADC2EN                                        RCM_APB2CLKEN_ADC2EN_Msk
#define RCM_APB2CLKEN_ADC3EN_Pos                                    (10U)
#define RCM_APB2CLKEN_ADC3EN_Msk                                    (0x1UL << RCM_APB2CLKEN_ADC3EN_Pos)                            /*!< 0x00000400 */
#define RCM_APB2CLKEN_ADC3EN                                        RCM_APB2CLKEN_ADC3EN_Msk
#define RCM_APB2CLKEN_SDIOEN_Pos                                    (11U)
#define RCM_APB2CLKEN_SDIOEN_Msk                                    (0x1UL << RCM_APB2CLKEN_SDIOEN_Pos)                            /*!< 0x00000800 */
#define RCM_APB2CLKEN_SDIOEN                                        RCM_APB2CLKEN_SDIOEN_Msk
#define RCM_APB2CLKEN_SPI1EN_Pos                                    (12U)
#define RCM_APB2CLKEN_SPI1EN_Msk                                    (0x1UL << RCM_APB2CLKEN_SPI1EN_Pos)                            /*!< 0x00001000 */
#define RCM_APB2CLKEN_SPI1EN                                        RCM_APB2CLKEN_SPI1EN_Msk
#define RCM_APB2CLKEN_SYSCFGEN_Pos                                  (14U)
#define RCM_APB2CLKEN_SYSCFGEN_Msk                                  (0x1UL << RCM_APB2CLKEN_SYSCFGEN_Pos)                          /*!< 0x00004000 */
#define RCM_APB2CLKEN_SYSCFGEN                                      RCM_APB2CLKEN_SYSCFGEN_Msk
#define RCM_APB2CLKEN_TMR9EN_Pos                                    (16U)
#define RCM_APB2CLKEN_TMR9EN_Msk                                    (0x1UL << RCM_APB2CLKEN_TMR9EN_Pos)                            /*!< 0x00010000 */
#define RCM_APB2CLKEN_TMR9EN                                        RCM_APB2CLKEN_TMR9EN_Msk
#define RCM_APB2CLKEN_TMR10EN_Pos                                   (17U)
#define RCM_APB2CLKEN_TMR10EN_Msk                                   (0x1UL << RCM_APB2CLKEN_TMR10EN_Pos)                           /*!< 0x00020000 */
#define RCM_APB2CLKEN_TMR10EN                                       RCM_APB2CLKEN_TMR10EN_Msk
#define RCM_APB2CLKEN_TMR11EN_Pos                                   (18U)
#define RCM_APB2CLKEN_TMR11EN_Msk                                   (0x1UL << RCM_APB2CLKEN_TMR11EN_Pos)                           /*!< 0x00040000 */
#define RCM_APB2CLKEN_TMR11EN                                       RCM_APB2CLKEN_TMR11EN_Msk

