kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/*****************  Bit definition for SYSCFG_EINTCFG3 register  ***************/
#define SYSCFG_EINTCFG3_EINT8_Pos                                   (0U)
#define SYSCFG_EINTCFG3_EINT8_Msk                                   (0xFUL << SYSCFG_EINTCFG3_EINT8_Pos)                           /*!< 0x0000000F */
#define SYSCFG_EINTCFG3_EINT8                                       SYSCFG_EINTCFG3_EINT8_Msk                                      /*!<EINT 8 configuration */
#define SYSCFG_EINTCFG3_EINT9_Pos                                   (4U)
#define SYSCFG_EINTCFG3_EINT9_Msk                                   (0xFUL << SYSCFG_EINTCFG3_EINT9_Pos)                           /*!< 0x000000F0 */
#define SYSCFG_EINTCFG3_EINT9                                       SYSCFG_EINTCFG3_EINT9_Msk                                      /*!<EINT 9 configuration */
#define SYSCFG_EINTCFG3_EINT10_Pos                                  (8U)
#define SYSCFG_EINTCFG3_EINT10_Msk                                  (0xFUL << SYSCFG_EINTCFG3_EINT10_Pos)                          /*!< 0x00000F00 */
#define SYSCFG_EINTCFG3_EINT10                                      SYSCFG_EINTCFG3_EINT10_Msk                                     /*!<EINT 10 configuration */
#define SYSCFG_EINTCFG3_EINT11_Pos                                  (12U)
#define SYSCFG_EINTCFG3_EINT11_Msk                                  (0xFUL << SYSCFG_EINTCFG3_EINT11_Pos)                          /*!< 0x0000F000 */
#define SYSCFG_EINTCFG3_EINT11                                      SYSCFG_EINTCFG3_EINT11_Msk                                     /*!<EINT 11 configuration */

/**
  * @brief   EINT8 configuration
  */
#define SYSCFG_EINTCFG3_EINT8_PA                                    0x0000U                                                        /*!<PA[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PB                                    0x0001U                                                        /*!<PB[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PC                                    0x0002U                                                        /*!<PC[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PD                                    0x0003U                                                        /*!<PD[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PE                                    0x0004U                                                        /*!<PE[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PF                                    0x0005U                                                        /*!<PF[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PG                                    0x0006U                                                        /*!<PG[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PH                                    0x0007U                                                        /*!<PH[8] pin */
#define SYSCFG_EINTCFG3_EINT8_PI                                    0x0008U                                                        /*!<PI[8] pin */

/**
  * @brief   EINT9 configuration
  */
#define SYSCFG_EINTCFG3_EINT9_PA                                    0x0000U                                                        /*!<PA[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PB                                    0x0010U                                                        /*!<PB[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PC                                    0x0020U                                                        /*!<PC[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PD                                    0x0030U                                                        /*!<PD[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PE                                    0x0040U                                                        /*!<PE[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PF                                    0x0050U                                                        /*!<PF[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PG                                    0x0060U                                                        /*!<PG[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PH                                    0x0070U                                                        /*!<PH[9] pin */
#define SYSCFG_EINTCFG3_EINT9_PI                                    0x0080U                                                        /*!<PI[9] pin */

/**
  * @brief   EINT10 configuration
  */
#define SYSCFG_EINTCFG3_EINT10_PA                                   0x0000U                                                        /*!<PA[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PB                                   0x0100U                                                        /*!<PB[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PC                                   0x0200U                                                        /*!<PC[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PD                                   0x0300U                                                        /*!<PD[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PE                                   0x0400U                                                        /*!<PE[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PF                                   0x0500U                                                        /*!<PF[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PG                                   0x0600U                                                        /*!<PG[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PH                                   0x0700U                                                        /*!<PH[10] pin */
#define SYSCFG_EINTCFG3_EINT10_PI                                   0x0800U                                                        /*!<PI[10] pin */

/**
  * @brief   EINT11 configuration
  */
#define SYSCFG_EINTCFG3_EINT11_PA                                   0x0000U                                                        /*!<PA[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PB                                   0x1000U                                                        /*!<PB[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PC                                   0x2000U                                                        /*!<PC[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PD                                   0x3000U                                                        /*!<PD[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PE                                   0x4000U                                                        /*!<PE[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PF                                   0x5000U                                                        /*!<PF[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PG                                   0x6000U                                                        /*!<PG[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PH                                   0x7000U                                                        /*!<PH[11] pin */
#define SYSCFG_EINTCFG3_EINT11_PI                                   0x8000U                                                        /*!<PI[11] pin */

/*****************  Bit definition for SYSCFG_EINTCFG4 register  ***************/
#define SYSCFG_EINTCFG4_EINT12_Pos                                  (0U)
#define SYSCFG_EINTCFG4_EINT12_Msk                                  (0xFUL << SYSCFG_EINTCFG4_EINT12_Pos)                          /*!< 0x0000000F */
#define SYSCFG_EINTCFG4_EINT12                                      SYSCFG_EINTCFG4_EINT12_Msk                                     /*!<EINT 12 configuration */
#define SYSCFG_EINTCFG4_EINT13_Pos                                  (4U)
#define SYSCFG_EINTCFG4_EINT13_Msk                                  (0xFUL << SYSCFG_EINTCFG4_EINT13_Pos)                          /*!< 0x000000F0 */
#define SYSCFG_EINTCFG4_EINT13                                      SYSCFG_EINTCFG4_EINT13_Msk                                     /*!<EINT 13 configuration */
#define SYSCFG_EINTCFG4_EINT14_Pos                                  (8U)
#define SYSCFG_EINTCFG4_EINT14_Msk                                  (0xFUL << SYSCFG_EINTCFG4_EINT14_Pos)                          /*!< 0x00000F00 */
#define SYSCFG_EINTCFG4_EINT14                                      SYSCFG_EINTCFG4_EINT14_Msk                                     /*!<EINT 14 configuration */
#define SYSCFG_EINTCFG4_EINT15_Pos                                  (12U)
#define SYSCFG_EINTCFG4_EINT15_Msk                                  (0xFUL << SYSCFG_EINTCFG4_EINT15_Pos)                          /*!< 0x0000F000 */
#define SYSCFG_EINTCFG4_EINT15                                      SYSCFG_EINTCFG4_EINT15_Msk                                     /*!<EINT 15 configuration */

/**
  * @brief   EINT12 configuration
  */
#define SYSCFG_EINTCFG4_EINT12_PA                                   0x0000U                                                        /*!<PA[12] pin */
#define SYSCFG_EINTCFG4_EINT12_PB                                   0x0001U                                                        /*!<PB[12] pin */
#define SYSCFG_EINTCFG4_EINT12_PC                                   0x0002U                                                        /*!<PC[12] pin */
#define SYSCFG_EINTCFG4_EINT12_PD                                   0x0003U                                                        /*!<PD[12] pin */
#define SYSCFG_EINTCFG4_EINT12_PE                                   0x0004U                                                        /*!<PE[12] pin */
#define SYSCFG_EINTCFG4_EINT12_PF                                   0x0005U                                                        /*!<PF[12] pin */
#define SYSCFG_EINTCFG4_EINT12_PG                                   0x0006U                                                        /*!<PG[12] pin */
#define SYSCFG_EINTCFG4_EINT12_PH                                   0x0007U                                                        /*!<PH[12] pin */

/**
  * @brief   EINT13 configuration
  */
#define SYSCFG_EINTCFG4_EINT13_PA                                   0x0000U                                                        /*!<PA[13] pin */
#define SYSCFG_EINTCFG4_EINT13_PB                                   0x0010U                                                        /*!<PB[13] pin */
#define SYSCFG_EINTCFG4_EINT13_PC                                   0x0020U                                                        /*!<PC[13] pin */
#define SYSCFG_EINTCFG4_EINT13_PD                                   0x0030U                                                        /*!<PD[13] pin */
#define SYSCFG_EINTCFG4_EINT13_PE                                   0x0040U                                                        /*!<PE[13] pin */
#define SYSCFG_EINTCFG4_EINT13_PF                                   0x0050U                                                        /*!<PF[13] pin */
#define SYSCFG_EINTCFG4_EINT13_PG                                   0x0060U                                                        /*!<PG[13] pin */
#define SYSCFG_EINTCFG4_EINT13_PH                                   0x0070U                                                        /*!<PH[13] pin */

/**
  * @brief   EINT14 configuration
  */
#define SYSCFG_EINTCFG4_EINT14_PA                                   0x0000U                                                        /*!<PA[14] pin */
#define SYSCFG_EINTCFG4_EINT14_PB                                   0x0100U                                                        /*!<PB[14] pin */
#define SYSCFG_EINTCFG4_EINT14_PC                                   0x0200U                                                        /*!<PC[14] pin */
#define SYSCFG_EINTCFG4_EINT14_PD                                   0x0300U                                                        /*!<PD[14] pin */
#define SYSCFG_EINTCFG4_EINT14_PE                                   0x0400U                                                        /*!<PE[14] pin */
#define SYSCFG_EINTCFG4_EINT14_PF                                   0x0500U                                                        /*!<PF[14] pin */
#define SYSCFG_EINTCFG4_EINT14_PG                                   0x0600U                                                        /*!<PG[14] pin */
#define SYSCFG_EINTCFG4_EINT14_PH                                   0x0700U                                                        /*!<PH[14] pin */

/**
  * @brief   EINT15 configuration
  */
#define SYSCFG_EINTCFG4_EINT15_PA                                   0x0000U                                                        /*!<PA[15] pin */
#define SYSCFG_EINTCFG4_EINT15_PB                                   0x1000U                                                        /*!<PB[15] pin */
#define SYSCFG_EINTCFG4_EINT15_PC                                   0x2000U                                                        /*!<PC[15] pin */
#define SYSCFG_EINTCFG4_EINT15_PD                                   0x3000U                                                        /*!<PD[15] pin */
#define SYSCFG_EINTCFG4_EINT15_PE                                   0x4000U                                                        /*!<PE[15] pin */
#define SYSCFG_EINTCFG4_EINT15_PF                                   0x5000U                                                        /*!<PF[15] pin */
#define SYSCFG_EINTCFG4_EINT15_PG                                   0x6000U                                                        /*!<PG[15] pin */
#define SYSCFG_EINTCFG4_EINT15_PH                                   0x7000U                                                        /*!<PH[15] pin */

