kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/******************  Bit definition for SYSCFG_CCCTRL register  ****************/
#define SYSCFG_CCCTRL_CCPD_Pos                                      (0U)
#define SYSCFG_CCCTRL_CCPD_Msk                                      (0x1UL << SYSCFG_CCCTRL_CCPD_Pos)                              /*!< 0x00000001 */
#define SYSCFG_CCCTRL_CCPD                                          SYSCFG_CCCTRL_CCPD_Msk                                         /*!<Compensation cell ready flag */
#define SYSCFG_CCCTRL_RDYFLG_Pos                                    (8U)
#define SYSCFG_CCCTRL_RDYFLG_Msk                                    (0x1UL << SYSCFG_CCCTRL_RDYFLG_Pos)                            /*!< 0x00000100 */
#define SYSCFG_CCCTRL_RDYFLG                                        SYSCFG_CCCTRL_RDYFLG_Msk                                       /*!<Compensation cell power-down */

/******************************************************************************/
/*                                                                            */
/*                                    TMR                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for TMR_CTRL1 register  ********************/
#define TMR_CTRL1_CNTEN_Pos                                         (0U)
#define TMR_CTRL1_CNTEN_Msk                                         (0x1UL << TMR_CTRL1_CNTEN_Pos)                                 /*!< 0x00000001 */
#define TMR_CTRL1_CNTEN                                             TMR_CTRL1_CNTEN_Msk                                            /*!<Counter enable        */
#define TMR_CTRL1_UD_Pos                                            (1U)
#define TMR_CTRL1_UD_Msk                                            (0x1UL << TMR_CTRL1_UD_Pos)                                    /*!< 0x00000002 */
#define TMR_CTRL1_UD                                                TMR_CTRL1_UD_Msk                                               /*!<Update disable        */
#define TMR_CTRL1_URSSEL_Pos                                        (2U)
#define TMR_CTRL1_URSSEL_Msk                                        (0x1UL << TMR_CTRL1_URSSEL_Pos)                                /*!< 0x00000004 */
#define TMR_CTRL1_URSSEL                                            TMR_CTRL1_URSSEL_Msk                                           /*!<Update request source */
#define TMR_CTRL1_SPMEN_Pos                                         (3U)
#define TMR_CTRL1_SPMEN_Msk                                         (0x1UL << TMR_CTRL1_SPMEN_Pos)                                 /*!< 0x00000008 */
#define TMR_CTRL1_SPMEN                                             TMR_CTRL1_SPMEN_Msk                                            /*!<One pulse mode        */
#define TMR_CTRL1_CNTDIR_Pos                                        (4U)
#define TMR_CTRL1_CNTDIR_Msk                                        (0x1UL << TMR_CTRL1_CNTDIR_Pos)                                /*!< 0x00000010 */
#define TMR_CTRL1_CNTDIR                                            TMR_CTRL1_CNTDIR_Msk                                           /*!<Direction             */

#define TMR_CTRL1_CAMSEL_Pos                                        (5U)
#define TMR_CTRL1_CAMSEL_Msk                                        (0x3UL << TMR_CTRL1_CAMSEL_Pos)                                /*!< 0x00000060 */
#define TMR_CTRL1_CAMSEL                                            TMR_CTRL1_CAMSEL_Msk                                           /*!<CMS[1:0] bits (Center-aligned mode selection) */
#define TMR_CTRL1_CAMSEL_0                                          (0x1UL << TMR_CTRL1_CAMSEL_Pos)                                /*!< 0x0020 */
#define TMR_CTRL1_CAMSEL_1                                          (0x2UL << TMR_CTRL1_CAMSEL_Pos)                                /*!< 0x0040 */

#define TMR_CTRL1_ARPEN_Pos                                         (7U)
#define TMR_CTRL1_ARPEN_Msk                                         (0x1UL << TMR_CTRL1_ARPEN_Pos)                                 /*!< 0x00000080 */
#define TMR_CTRL1_ARPEN                                             TMR_CTRL1_ARPEN_Msk                                            /*!<Auto-reload preload enable     */

#define TMR_CTRL1_CLKDIV_Pos                                        (8U)
#define TMR_CTRL1_CLKDIV_Msk                                        (0x3UL << TMR_CTRL1_CLKDIV_Pos)                                /*!< 0x00000300 */
#define TMR_CTRL1_CLKDIV                                            TMR_CTRL1_CLKDIV_Msk                                           /*!<CKD[1:0] bits (clock division) */
#define TMR_CTRL1_CLKDIV_0                                          (0x1UL << TMR_CTRL1_CLKDIV_Pos)                                /*!< 0x0100 */
#define TMR_CTRL1_CLKDIV_1                                          (0x2UL << TMR_CTRL1_CLKDIV_Pos)                                /*!< 0x0200 */

/*******************  Bit definition for TMR_CTRL2 register  ********************/
#define TMR_CTRL2_CCPEN_Pos                                         (0U)
#define TMR_CTRL2_CCPEN_Msk                                         (0x1UL << TMR_CTRL2_CCPEN_Pos)                                 /*!< 0x00000001 */
#define TMR_CTRL2_CCPEN                                             TMR_CTRL2_CCPEN_Msk                                            /*!<Capture/Compare Preloaded Control        */
#define TMR_CTRL2_CCUSEL_Pos                                        (2U)
#define TMR_CTRL2_CCUSEL_Msk                                        (0x1UL << TMR_CTRL2_CCUSEL_Pos)                                /*!< 0x00000004 */
#define TMR_CTRL2_CCUSEL                                            TMR_CTRL2_CCUSEL_Msk                                           /*!<Capture/Compare Control Update Selection */
#define TMR_CTRL2_CCDSEL_Pos                                        (3U)
#define TMR_CTRL2_CCDSEL_Msk                                        (0x1UL << TMR_CTRL2_CCDSEL_Pos)                                /*!< 0x00000008 */
#define TMR_CTRL2_CCDSEL                                            TMR_CTRL2_CCDSEL_Msk                                           /*!<Capture/Compare DMA Selection            */

