kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
/********************  Bit definition forUSB_OTG_DVBUSPTIM register  ********************/
#define USB_OTG_DVBUSPTIM_VBUSPTIM_Pos                              (0U)
#define USB_OTG_DVBUSPTIM_VBUSPTIM_Msk                              (0xFFFUL << USB_OTG_DVBUSPTIM_VBUSPTIM_Pos)                    /*!< 0x00000FFF */
#define USB_OTG_DVBUSPTIM_VBUSPTIM                                  USB_OTG_DVBUSPTIM_VBUSPTIM_Msk                                 /*!< Device VBUS pulsing time */

/********************  Bit definition for USB_OTG_GNPTXFQSTS register  ********************/
#define USB_OTG_GNPTXFQSTS_NPTXFSA_Pos                              (0U)
#define USB_OTG_GNPTXFQSTS_NPTXFSA_Msk                              (0xFFFFUL << USB_OTG_GNPTXFQSTS_NPTXFSA_Pos)                   /*!< 0x0000FFFF */
#define USB_OTG_GNPTXFQSTS_NPTXFSA                                  USB_OTG_GNPTXFQSTS_NPTXFSA_Msk                                 /*!< Nonperiodic TxFIFO space available */

#define USB_OTG_GNPTXFQSTS_NPTXRSA_Pos                              (16U)
#define USB_OTG_GNPTXFQSTS_NPTXRSA_Msk                              (0xFFUL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00FF0000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA                                  USB_OTG_GNPTXFQSTS_NPTXRSA_Msk                                 /*!< Nonperiodic transmit request queue space available */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_0                                (0x01UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00010000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_1                                (0x02UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00020000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_2                                (0x04UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00040000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_3                                (0x08UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00080000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_4                                (0x10UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00100000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_5                                (0x20UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00200000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_6                                (0x40UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00400000 */
#define USB_OTG_GNPTXFQSTS_NPTXRSA_7                                (0x80UL << USB_OTG_GNPTXFQSTS_NPTXRSA_Pos)                     /*!< 0x00800000 */

#define USB_OTG_GNPTXFQSTS_NPTXRQ_Pos                               (24U)
#define USB_OTG_GNPTXFQSTS_NPTXRQ_Msk                               (0x7FUL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x7F000000 */
#define USB_OTG_GNPTXFQSTS_NPTXRQ                                   USB_OTG_GNPTXFQSTS_NPTXRQ_Msk                                  /*!< Top of the nonperiodic transmit request queue */
#define USB_OTG_GNPTXFQSTS_NPTXRQ_0                                 (0x01UL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x01000000 */
#define USB_OTG_GNPTXFQSTS_NPTXRQ_1                                 (0x02UL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x02000000 */
#define USB_OTG_GNPTXFQSTS_NPTXRQ_2                                 (0x04UL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x04000000 */
#define USB_OTG_GNPTXFQSTS_NPTXRQ_3                                 (0x08UL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x08000000 */
#define USB_OTG_GNPTXFQSTS_NPTXRQ_4                                 (0x10UL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x10000000 */
#define USB_OTG_GNPTXFQSTS_NPTXRQ_5                                 (0x20UL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x20000000 */
#define USB_OTG_GNPTXFQSTS_NPTXRQ_6                                 (0x40UL << USB_OTG_GNPTXFQSTS_NPTXRQ_Pos)                      /*!< 0x40000000 */

/********************  Bit definition for USB_OTG_DTHCTRL register  ********************/
#define USB_OTG_DTHCTRL_NSINTHEN_Pos                                (0U)
#define USB_OTG_DTHCTRL_NSINTHEN_Msk                                (0x1UL << USB_OTG_DTHCTRL_NSINTHEN_Pos)                        /*!< 0x00000001 */
#define USB_OTG_DTHCTRL_NSINTHEN                                    USB_OTG_DTHCTRL_NSINTHEN_Msk                                   /*!< Nonisochronous IN endpoints threshold enable */
#define USB_OTG_DTHCTRL_SINTHEN_Pos                                 (1U)
#define USB_OTG_DTHCTRL_SINTHEN_Msk                                 (0x1UL << USB_OTG_DTHCTRL_SINTHEN_Pos)                         /*!< 0x00000002 */
#define USB_OTG_DTHCTRL_SINTHEN                                     USB_OTG_DTHCTRL_SINTHEN_Msk                                    /*!< ISO IN endpoint threshold enable */

#define USB_OTG_DTHCTRL_TXTHLTH_Pos                                 (2U)
#define USB_OTG_DTHCTRL_TXTHLTH_Msk                                 (0x1FFUL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x000007FC */
#define USB_OTG_DTHCTRL_TXTHLTH                                     USB_OTG_DTHCTRL_TXTHLTH_Msk                                    /*!< Transmit threshold length */
#define USB_OTG_DTHCTRL_TXTHLTH_0                                   (0x001UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000004 */
#define USB_OTG_DTHCTRL_TXTHLTH_1                                   (0x002UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000008 */
#define USB_OTG_DTHCTRL_TXTHLTH_2                                   (0x004UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000010 */
#define USB_OTG_DTHCTRL_TXTHLTH_3                                   (0x008UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000020 */
#define USB_OTG_DTHCTRL_TXTHLTH_4                                   (0x010UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000040 */
#define USB_OTG_DTHCTRL_TXTHLTH_5                                   (0x020UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000080 */
#define USB_OTG_DTHCTRL_TXTHLTH_6                                   (0x040UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000100 */
#define USB_OTG_DTHCTRL_TXTHLTH_7                                   (0x080UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000200 */
#define USB_OTG_DTHCTRL_TXTHLTH_8                                   (0x100UL << USB_OTG_DTHCTRL_TXTHLTH_Pos)                       /*!< 0x00000400 */
#define USB_OTG_DTHCTRL_RXTHEN_Pos                                  (16U)
#define USB_OTG_DTHCTRL_RXTHEN_Msk                                  (0x1UL << USB_OTG_DTHCTRL_RXTHEN_Pos)                          /*!< 0x00010000 */
#define USB_OTG_DTHCTRL_RXTHEN                                      USB_OTG_DTHCTRL_RXTHEN_Msk                                     /*!< Receive threshold enable */

#define USB_OTG_DTHCTRL_RXTHLTH_Pos                                 (17U)
#define USB_OTG_DTHCTRL_RXTHLTH_Msk                                 (0x1FFUL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x03FE0000 */
#define USB_OTG_DTHCTRL_RXTHLTH                                     USB_OTG_DTHCTRL_RXTHLTH_Msk                                    /*!< Receive threshold length */
#define USB_OTG_DTHCTRL_RXTHLTH_0                                   (0x001UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x00020000 */
#define USB_OTG_DTHCTRL_RXTHLTH_1                                   (0x002UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x00040000 */
#define USB_OTG_DTHCTRL_RXTHLTH_2                                   (0x004UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x00080000 */
#define USB_OTG_DTHCTRL_RXTHLTH_3                                   (0x008UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x00100000 */
#define USB_OTG_DTHCTRL_RXTHLTH_4                                   (0x010UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x00200000 */
#define USB_OTG_DTHCTRL_RXTHLTH_5                                   (0x020UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x00400000 */
#define USB_OTG_DTHCTRL_RXTHLTH_6                                   (0x040UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x00800000 */
#define USB_OTG_DTHCTRL_RXTHLTH_7                                   (0x080UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x01000000 */
#define USB_OTG_DTHCTRL_RXTHLTH_8                                   (0x100UL << USB_OTG_DTHCTRL_RXTHLTH_Pos)                       /*!< 0x02000000 */
#define USB_OTG_DTHCTRL_APARKEN_Pos                                 (27U)
#define USB_OTG_DTHCTRL_APARKEN_Msk                                 (0x1UL << USB_OTG_DTHCTRL_APARKEN_Pos)                         /*!< 0x08000000 */
#define USB_OTG_DTHCTRL_APARKEN                                     USB_OTG_DTHCTRL_APARKEN_Msk                                    /*!< Arbiter parking enable */

/********************  Bit definition for USB_OTG_DIEIMASK register  ********************/
#define USB_OTG_DIEIMASK_INEM_Pos                                   (0U)
#define USB_OTG_DIEIMASK_INEM_Msk                                   (0xFFFFUL << USB_OTG_DIEIMASK_INEM_Pos)                        /*!< 0x0000FFFF */
#define USB_OTG_DIEIMASK_INEM                                       USB_OTG_DIEIMASK_INEM_Msk                                      /*!< IN EP Tx FIFO empty interrupt mask bits */

/********************  Bit definition for USB_OTG_DEPINT register  ********************/
#define USB_OTG_DEPINT_IN1INT_Pos                                   (1U)
#define USB_OTG_DEPINT_IN1INT_Msk                                   (0x1UL << USB_OTG_DEPINT_IN1INT_Pos)                           /*!< 0x00000002 */
#define USB_OTG_DEPINT_IN1INT                                       USB_OTG_DEPINT_IN1INT_Msk                                      /*!< IN endpoint 1interrupt bit   */
#define USB_OTG_DEPINT_OUT1INT_Pos                                  (17U)
#define USB_OTG_DEPINT_OUT1INT_Msk                                  (0x1UL << USB_OTG_DEPINT_OUT1INT_Pos)                          /*!< 0x00020000 */
#define USB_OTG_DEPINT_OUT1INT                                      USB_OTG_DEPINT_OUT1INT_Msk                                     /*!< OUT endpoint 1 interrupt bit */

/********************  Bit definition for USB_OTG_GGCCFG register  ********************/
#define USB_OTG_GGCCFG_PWEN_Pos                                     (16U)
#define USB_OTG_GGCCFG_PWEN_Msk                                     (0x1UL << USB_OTG_GGCCFG_PWEN_Pos)                             /*!< 0x00010000 */
#define USB_OTG_GGCCFG_PWEN                                         USB_OTG_GGCCFG_PWEN_Msk                                        /*!< Power down */
#define USB_OTG_GGCCFG_I2CBEN_Pos                                   (17U)
#define USB_OTG_GGCCFG_I2CBEN_Msk                                   (0x1UL << USB_OTG_GGCCFG_I2CBEN_Pos)                           /*!< 0x00020000 */
#define USB_OTG_GGCCFG_I2CBEN                                       USB_OTG_GGCCFG_I2CBEN_Msk                                      /*!< Enable I2C bus connection for the external I2C PHY interface*/
#define USB_OTG_GGCCFG_ADVBSEN_Pos                                  (18U)
#define USB_OTG_GGCCFG_ADVBSEN_Msk                                  (0x1UL << USB_OTG_GGCCFG_ADVBSEN_Pos)                          /*!< 0x00040000 */
#define USB_OTG_GGCCFG_ADVBSEN                                      USB_OTG_GGCCFG_ADVBSEN_Msk                                     /*!< Enable the VBUS sensing device */
#define USB_OTG_GGCCFG_BDVBSEN_Pos                                  (19U)
#define USB_OTG_GGCCFG_BDVBSEN_Msk                                  (0x1UL << USB_OTG_GGCCFG_BDVBSEN_Pos)                          /*!< 0x00080000 */
#define USB_OTG_GGCCFG_BDVBSEN                                      USB_OTG_GGCCFG_BDVBSEN_Msk                                     /*!< Enable the VBUS sensing device */
#define USB_OTG_GGCCFG_SOFPOUT_Pos                                  (20U)
#define USB_OTG_GGCCFG_SOFPOUT_Msk                                  (0x1UL << USB_OTG_GGCCFG_SOFPOUT_Pos)                          /*!< 0x00100000 */
#define USB_OTG_GGCCFG_SOFPOUT                                      USB_OTG_GGCCFG_SOFPOUT_Msk                                     /*!< SOF output enable */
#define USB_OTG_GGCCFG_VBSDIS_Pos                                   (21U)
#define USB_OTG_GGCCFG_VBSDIS_Msk                                   (0x1UL << USB_OTG_GGCCFG_VBSDIS_Pos)                           /*!< 0x00200000 */
#define USB_OTG_GGCCFG_VBSDIS                                       USB_OTG_GGCCFG_VBSDIS_Msk                                      /*!< VBUS sensing disable option*/

/********************  Bit definition forUSB_OTG_DEPIMASK register  ********************/
#define USB_OTG_DEPIMASK_IN1M_Pos                                   (1U)
#define USB_OTG_DEPIMASK_IN1M_Msk                                   (0x1UL << USB_OTG_DEPIMASK_IN1M_Pos)                           /*!< 0x00000002 */
#define USB_OTG_DEPIMASK_IN1M                                       USB_OTG_DEPIMASK_IN1M_Msk                                      /*!< IN Endpoint 1 interrupt mask bit  */
#define USB_OTG_DEPIMASK_OUT1M_Pos                                  (17U)
#define USB_OTG_DEPIMASK_OUT1M_Msk                                  (0x1UL << USB_OTG_DEPIMASK_OUT1M_Pos)                          /*!< 0x00020000 */
#define USB_OTG_DEPIMASK_OUT1M                                      USB_OTG_DEPIMASK_OUT1M_Msk                                     /*!< OUT Endpoint 1 interrupt mask bit */

/********************  Bit definition for USB_OTG_GCID register  ********************/
#define USB_OTG_GCID_PID_Pos                                        (0U)
#define USB_OTG_GCID_PID_Msk                                        (0xFFFFFFFFUL << USB_OTG_GCID_PID_Pos)                         /*!< 0xFFFFFFFF */
#define USB_OTG_GCID_PID                                            USB_OTG_GCID_PID_Msk                                           /*!< Product ID field */

