kthunder/APM32/Libraries/Device/Geehy/APM32F4xx/Include/apm32f415xx.h
#define USB_OTG_HCH_CNTSEL_Pos                                      (20U)
#define USB_OTG_HCH_CNTSEL_Msk                                      (0x3UL << USB_OTG_HCH_CNTSEL_Pos)                              /*!< 0x00300000 */
#define USB_OTG_HCH_CNTSEL                                          USB_OTG_HCH_CNTSEL_Msk                                         /*!< Multi Count (MC) / Error Count (EC) */
#define USB_OTG_HCH_CNTSEL_0                                        (0x1UL << USB_OTG_HCH_CNTSEL_Pos)                              /*!< 0x00100000 */
#define USB_OTG_HCH_CNTSEL_1                                        (0x2UL << USB_OTG_HCH_CNTSEL_Pos)                              /*!< 0x00200000 */

#define USB_OTG_HCH_DVADDR_Pos                                      (22U)
#define USB_OTG_HCH_DVADDR_Msk                                      (0x7FUL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x1FC00000 */
#define USB_OTG_HCH_DVADDR                                          USB_OTG_HCH_DVADDR_Msk                                         /*!< Device address */
#define USB_OTG_HCH_DVADDR_0                                        (0x01UL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x00400000 */
#define USB_OTG_HCH_DVADDR_1                                        (0x02UL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x00800000 */
#define USB_OTG_HCH_DVADDR_2                                        (0x04UL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x01000000 */
#define USB_OTG_HCH_DVADDR_3                                        (0x08UL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x02000000 */
#define USB_OTG_HCH_DVADDR_4                                        (0x10UL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x04000000 */
#define USB_OTG_HCH_DVADDR_5                                        (0x20UL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x08000000 */
#define USB_OTG_HCH_DVADDR_6                                        (0x40UL << USB_OTG_HCH_DVADDR_Pos)                             /*!< 0x10000000 */
#define USB_OTG_HCH_ODDF_Pos                                        (29U)
#define USB_OTG_HCH_ODDF_Msk                                        (0x1UL << USB_OTG_HCH_ODDF_Pos)                                /*!< 0x20000000 */
#define USB_OTG_HCH_ODDF                                            USB_OTG_HCH_ODDF_Msk                                           /*!< Odd frame */
#define USB_OTG_HCH_CHINT_Pos                                       (30U)
#define USB_OTG_HCH_CHINT_Msk                                       (0x1UL << USB_OTG_HCH_CHINT_Pos)                               /*!< 0x40000000 */
#define USB_OTG_HCH_CHINT                                           USB_OTG_HCH_CHINT_Msk                                          /*!< Channel disable */
#define USB_OTG_HCH_CHEN_Pos                                        (31U)
#define USB_OTG_HCH_CHEN_Msk                                        (0x1UL << USB_OTG_HCH_CHEN_Pos)                                /*!< 0x80000000 */
#define USB_OTG_HCH_CHEN                                            USB_OTG_HCH_CHEN_Msk                                           /*!< Channel enable */

/********************  Bit definition for USB_OTG_HCHSCTRL register  ********************/

#define USB_OTG_HCHSCTRL_PADDR_Pos                                  (0U)
#define USB_OTG_HCHSCTRL_PADDR_Msk                                  (0x7FUL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x0000007F */
#define USB_OTG_HCHSCTRL_PADDR                                      USB_OTG_HCHSCTRL_PADDR_Msk                                     /*!< Port address */
#define USB_OTG_HCHSCTRL_PADDR_0                                    (0x01UL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x00000001 */
#define USB_OTG_HCHSCTRL_PADDR_1                                    (0x02UL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x00000002 */
#define USB_OTG_HCHSCTRL_PADDR_2                                    (0x04UL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x00000004 */
#define USB_OTG_HCHSCTRL_PADDR_3                                    (0x08UL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x00000008 */
#define USB_OTG_HCHSCTRL_PADDR_4                                    (0x10UL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x00000010 */
#define USB_OTG_HCHSCTRL_PADDR_5                                    (0x20UL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x00000020 */
#define USB_OTG_HCHSCTRL_PADDR_6                                    (0x40UL << USB_OTG_HCHSCTRL_PADDR_Pos)                         /*!< 0x00000040 */

#define USB_OTG_HCHSCTRL_HADDR_Pos                                  (7U)
#define USB_OTG_HCHSCTRL_HADDR_Msk                                  (0x7FUL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00003F80 */
#define USB_OTG_HCHSCTRL_HADDR                                      USB_OTG_HCHSCTRL_HADDR_Msk                                     /*!< Hub address */
#define USB_OTG_HCHSCTRL_HADDR_0                                    (0x01UL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00000080 */
#define USB_OTG_HCHSCTRL_HADDR_1                                    (0x02UL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00000100 */
#define USB_OTG_HCHSCTRL_HADDR_2                                    (0x04UL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00000200 */
#define USB_OTG_HCHSCTRL_HADDR_3                                    (0x08UL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00000400 */
#define USB_OTG_HCHSCTRL_HADDR_4                                    (0x10UL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00000800 */
#define USB_OTG_HCHSCTRL_HADDR_5                                    (0x20UL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00001000 */
#define USB_OTG_HCHSCTRL_HADDR_6                                    (0x40UL << USB_OTG_HCHSCTRL_HADDR_Pos)                         /*!< 0x00002000 */

#define USB_OTG_HCHSCTRL_TPOST_Pos                                  (14U)
#define USB_OTG_HCHSCTRL_TPOST_Msk                                  (0x3UL << USB_OTG_HCHSCTRL_TPOST_Pos)                          /*!< 0x0000C000 */
#define USB_OTG_HCHSCTRL_TPOST                                      USB_OTG_HCHSCTRL_TPOST_Msk                                     /*!< XACTPOS */
#define USB_OTG_HCHSCTRL_TPOST_0                                    (0x1UL << USB_OTG_HCHSCTRL_TPOST_Pos)                          /*!< 0x00004000 */
#define USB_OTG_HCHSCTRL_TPOST_1                                    (0x2UL << USB_OTG_HCHSCTRL_TPOST_Pos)                          /*!< 0x00008000 */
#define USB_OTG_HCHSCTRL_DO_CMP_SPL_Pos                             (16U)
#define USB_OTG_HCHSCTRL_DO_CMP_SPL_Msk                             (0x1UL << USB_OTG_HCHSCTRL_DO_CMP_SPL_Pos)                     /*!< 0x00010000 */
#define USB_OTG_HCHSCTRL_DO_CMP_SPL                                 USB_OTG_HCHSCTRL_DO_CMP_SPL_Msk                                /*!< Do complete split */
#define USB_OTG_HCHSCTRL_SPLEN_Pos                                  (31U)
#define USB_OTG_HCHSCTRL_SPLEN_Msk                                  (0x1UL << USB_OTG_HCHSCTRL_SPLEN_Pos)                          /*!< 0x80000000 */
#define USB_OTG_HCHSCTRL_SPLEN                                      USB_OTG_HCHSCTRL_SPLEN_Msk                                     /*!< Split enable */

